def @main(%input_tensor:0: Tensor[(1, 300, 300, 3), uint8]) -> (Tensor[(1, 100, 4), float32], Tensor[(1, 100), float32], Tensor[(1, 100), float32], Tensor[(1), float32], Tensor[(1, 12804, 4), float32], Tensor[(1, 12804, 91), float32]) {
  %0 = strided_slice(%input_tensor:0, begin=[0], end=[1], strides=[1], axes=[0]) /* ty=Tensor[(1, 300, 300, 3), uint8] */;
  %1 = squeeze(%0, axis=[0]) /* ty=Tensor[(300, 300, 3), uint8] */;
  %2 = cast(%1, dtype="float32") /* ty=Tensor[(300, 300, 3), float32] */;
  %3 = expand_dims(%2, axis=0) /* ty=Tensor[(1, 300, 300, 3), float32] */;
  %4 = strided_slice(%3, begin=[0, 0, 0, 0], end=[1000000000, 1000000000, 1000000000, 1000000000], strides=[1, 1, 1, 1], axes=[0, 1, 2, 3]) /* ty=Tensor[(1, 300, 300, 3), float32] */;
  %5 = multiply(0.00784314f /* ty=float32 */, %4) /* ty=Tensor[(1, 300, 300, 3), float32] */;
  %6 = subtract(%5, 1f /* ty=float32 */) /* ty=Tensor[(1, 300, 300, 3), float32] */;
  %7 = split(%6, indices_or_sections=1) /* ty=(Tensor[(1, 300, 300, 3), float32],) */;
  %8 = %7.0;
  %9 = transpose(%8, axes=[0, 3, 1, 2]) /* ty=Tensor[(1, 3, 300, 300), float32] */;
  %10 = image.resize(%9, size=[320, 320], coordinate_transformation_mode="asymmetric", rounding_method="floor", bicubic_alpha=-0.75f) /* ty=Tensor[(1, 3, 320, 320), float32] */;
  %11 = squeeze(%10, axis=[0]) /* ty=Tensor[(3, 320, 320), float32] */;
  %12 = expand_dims(%11, axis=1) /* ty=Tensor[(3, 1, 320, 320), float32] */;
  %13 = strided_slice(%12, begin=[0], end=[1], strides=[1], axes=[1]) /* ty=Tensor[(3, 1, 320, 320), float32] */;
  %14 = reshape(%13, newshape=[1, 3, 320, 320]) /* ty=Tensor[(1, 3, 320, 320), float32] */;
  %15 = nn.conv2d(%14, meta[relay.Constant][0] /* ty=Tensor[(32, 3, 3, 3), float32] */, strides=[2, 2], padding=[0, 0, 1, 1], kernel_size=[3, 3]) /* ty=Tensor[(1, 32, 160, 160), float32] */;
  %16 = nn.bias_add(%15, meta[relay.Constant][1] /* ty=Tensor[(32), float32] */) /* ty=Tensor[(1, 32, 160, 160), float32] */;
  %17 = maximum(%16, 0f /* ty=float32 */) /* ty=Tensor[(1, 32, 160, 160), float32] */;
  %18 = minimum(%17, 6f /* ty=float32 */) /* ty=Tensor[(1, 32, 160, 160), float32] */;
  %19 = nn.conv2d(%18, meta[relay.Constant][2] /* ty=Tensor[(32, 1, 3, 3), float32] */, padding=[1, 1, 1, 1], groups=32, kernel_size=[3, 3]) /* ty=Tensor[(1, 32, 160, 160), float32] */;
  %20 = nn.bias_add(%19, meta[relay.Constant][3] /* ty=Tensor[(32), float32] */) /* ty=Tensor[(1, 32, 160, 160), float32] */;
  %21 = maximum(%20, 0f /* ty=float32 */ /* ty=float32 */) /* ty=Tensor[(1, 32, 160, 160), float32] */;
  %22 = minimum(%21, 6f /* ty=float32 */ /* ty=float32 */) /* ty=Tensor[(1, 32, 160, 160), float32] */;
  %23 = nn.conv2d(%22, meta[relay.Constant][4] /* ty=Tensor[(16, 32, 1, 1), float32] */, padding=[0, 0, 0, 0], kernel_size=[1, 1]) /* ty=Tensor[(1, 16, 160, 160), float32] */;
  %24 = nn.bias_add(%23, meta[relay.Constant][5] /* ty=Tensor[(16), float32] */) /* ty=Tensor[(1, 16, 160, 160), float32] */;
  %25 = nn.conv2d(%24, meta[relay.Constant][6] /* ty=Tensor[(96, 16, 1, 1), float32] */, padding=[0, 0, 0, 0], kernel_size=[1, 1]) /* ty=Tensor[(1, 96, 160, 160), float32] */;
  %26 = nn.batch_norm(%25, meta[relay.Constant][7] /* ty=Tensor[(96), float32] */, meta[relay.Constant][8] /* ty=Tensor[(96), float32] */, meta[relay.Constant][9] /* ty=Tensor[(96), float32] */, meta[relay.Constant][10] /* ty=Tensor[(96), float32] */, epsilon=0.001f) /* ty=(Tensor[(1, 96, 160, 160), float32], Tensor[(96), float32], Tensor[(96), float32]) */;
  %27 = %26.0;
  %28 = maximum(%27, 0f /* ty=float32 */ /* ty=float32 */ /* ty=float32 */) /* ty=Tensor[(1, 96, 160, 160), float32] */;
  %29 = minimum(%28, 6f /* ty=float32 */ /* ty=float32 */ /* ty=float32 */) /* ty=Tensor[(1, 96, 160, 160), float32] */;
  %30 = nn.conv2d(%29, meta[relay.Constant][11] /* ty=Tensor[(96, 1, 3, 3), float32] */, strides=[2, 2], padding=[0, 0, 1, 1], groups=96, kernel_size=[3, 3]) /* ty=Tensor[(1, 96, 80, 80), float32] */;
  %31 = nn.bias_add(%30, meta[relay.Constant][12] /* ty=Tensor[(96), float32] */) /* ty=Tensor[(1, 96, 80, 80), float32] */;
  %32 = maximum(%31, 0f /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */) /* ty=Tensor[(1, 96, 80, 80), float32] */;
  %33 = minimum(%32, 6f /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */) /* ty=Tensor[(1, 96, 80, 80), float32] */;
  %34 = nn.conv2d(%33, meta[relay.Constant][13] /* ty=Tensor[(24, 96, 1, 1), float32] */, padding=[0, 0, 0, 0], kernel_size=[1, 1]) /* ty=Tensor[(1, 24, 80, 80), float32] */;
  %35 = nn.bias_add(%34, meta[relay.Constant][14] /* ty=Tensor[(24), float32] */) /* ty=Tensor[(1, 24, 80, 80), float32] */;
  %36 = nn.conv2d(%35, meta[relay.Constant][15] /* ty=Tensor[(144, 24, 1, 1), float32] */, padding=[0, 0, 0, 0], kernel_size=[1, 1]) /* ty=Tensor[(1, 144, 80, 80), float32] */;
  %37 = nn.batch_norm(%36, meta[relay.Constant][16] /* ty=Tensor[(144), float32] */, meta[relay.Constant][17] /* ty=Tensor[(144), float32] */, meta[relay.Constant][18] /* ty=Tensor[(144), float32] */, meta[relay.Constant][19] /* ty=Tensor[(144), float32] */, epsilon=0.001f) /* ty=(Tensor[(1, 144, 80, 80), float32], Tensor[(144), float32], Tensor[(144), float32]) */;
  %38 = %37.0;
  %39 = maximum(%38, 0f /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */) /* ty=Tensor[(1, 144, 80, 80), float32] */;
  %40 = minimum(%39, 6f /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */) /* ty=Tensor[(1, 144, 80, 80), float32] */;
  %41 = nn.conv2d(%40, meta[relay.Constant][20] /* ty=Tensor[(144, 1, 3, 3), float32] */, padding=[1, 1, 1, 1], groups=144, kernel_size=[3, 3]) /* ty=Tensor[(1, 144, 80, 80), float32] */;
  %42 = nn.bias_add(%41, meta[relay.Constant][21] /* ty=Tensor[(144), float32] */) /* ty=Tensor[(1, 144, 80, 80), float32] */;
  %43 = maximum(%42, 0f /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */) /* ty=Tensor[(1, 144, 80, 80), float32] */;
  %44 = minimum(%43, 6f /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */) /* ty=Tensor[(1, 144, 80, 80), float32] */;
  %45 = nn.conv2d(%44, meta[relay.Constant][22] /* ty=Tensor[(24, 144, 1, 1), float32] */, padding=[0, 0, 0, 0], kernel_size=[1, 1]) /* ty=Tensor[(1, 24, 80, 80), float32] */;
  %46 = nn.bias_add(%45, meta[relay.Constant][23] /* ty=Tensor[(24), float32] */) /* ty=Tensor[(1, 24, 80, 80), float32] */;
  %47 = add(%35, %46) /* ty=Tensor[(1, 24, 80, 80), float32] */;
  %48 = nn.conv2d(%47, meta[relay.Constant][24] /* ty=Tensor[(144, 24, 1, 1), float32] */, padding=[0, 0, 0, 0], kernel_size=[1, 1]) /* ty=Tensor[(1, 144, 80, 80), float32] */;
  %49 = nn.bias_add(%48, meta[relay.Constant][25] /* ty=Tensor[(144), float32] */) /* ty=Tensor[(1, 144, 80, 80), float32] */;
  %50 = maximum(%49, 0f /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */) /* ty=Tensor[(1, 144, 80, 80), float32] */;
  %51 = minimum(%50, 6f /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */) /* ty=Tensor[(1, 144, 80, 80), float32] */;
  %52 = nn.conv2d(%51, meta[relay.Constant][26] /* ty=Tensor[(144, 1, 3, 3), float32] */, strides=[2, 2], padding=[0, 0, 1, 1], groups=144, kernel_size=[3, 3]) /* ty=Tensor[(1, 144, 40, 40), float32] */;
  %53 = nn.bias_add(%52, meta[relay.Constant][27] /* ty=Tensor[(144), float32] */) /* ty=Tensor[(1, 144, 40, 40), float32] */;
  %54 = maximum(%53, 0f /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */) /* ty=Tensor[(1, 144, 40, 40), float32] */;
  %55 = minimum(%54, 6f /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */) /* ty=Tensor[(1, 144, 40, 40), float32] */;
  %56 = nn.conv2d(%55, meta[relay.Constant][28] /* ty=Tensor[(32, 144, 1, 1), float32] */, padding=[0, 0, 0, 0], kernel_size=[1, 1]) /* ty=Tensor[(1, 32, 40, 40), float32] */;
  %57 = nn.bias_add(%56, meta[relay.Constant][29] /* ty=Tensor[(32), float32] */) /* ty=Tensor[(1, 32, 40, 40), float32] */;
  %58 = nn.conv2d(%57, meta[relay.Constant][30] /* ty=Tensor[(192, 32, 1, 1), float32] */, padding=[0, 0, 0, 0], kernel_size=[1, 1]) /* ty=Tensor[(1, 192, 40, 40), float32] */;
  %59 = nn.batch_norm(%58, meta[relay.Constant][31] /* ty=Tensor[(192), float32] */, meta[relay.Constant][32] /* ty=Tensor[(192), float32] */, meta[relay.Constant][33] /* ty=Tensor[(192), float32] */, meta[relay.Constant][34] /* ty=Tensor[(192), float32] */, epsilon=0.001f) /* ty=(Tensor[(1, 192, 40, 40), float32], Tensor[(192), float32], Tensor[(192), float32]) */;
  %60 = %59.0;
  %61 = maximum(%60, 0f /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */) /* ty=Tensor[(1, 192, 40, 40), float32] */;
  %62 = minimum(%61, 6f /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */) /* ty=Tensor[(1, 192, 40, 40), float32] */;
  %63 = nn.conv2d(%62, meta[relay.Constant][35] /* ty=Tensor[(192, 1, 3, 3), float32] */, padding=[1, 1, 1, 1], groups=192, kernel_size=[3, 3]) /* ty=Tensor[(1, 192, 40, 40), float32] */;
  %64 = nn.bias_add(%63, meta[relay.Constant][36] /* ty=Tensor[(192), float32] */) /* ty=Tensor[(1, 192, 40, 40), float32] */;
  %65 = maximum(%64, 0f /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */) /* ty=Tensor[(1, 192, 40, 40), float32] */;
  %66 = minimum(%65, 6f /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */) /* ty=Tensor[(1, 192, 40, 40), float32] */;
  %67 = nn.conv2d(%66, meta[relay.Constant][37] /* ty=Tensor[(32, 192, 1, 1), float32] */, padding=[0, 0, 0, 0], kernel_size=[1, 1]) /* ty=Tensor[(1, 32, 40, 40), float32] */;
  %68 = nn.bias_add(%67, meta[relay.Constant][38] /* ty=Tensor[(32), float32] */) /* ty=Tensor[(1, 32, 40, 40), float32] */;
  %69 = add(%57, %68) /* ty=Tensor[(1, 32, 40, 40), float32] */;
  %70 = nn.conv2d(%69, meta[relay.Constant][39] /* ty=Tensor[(192, 32, 1, 1), float32] */, padding=[0, 0, 0, 0], kernel_size=[1, 1]) /* ty=Tensor[(1, 192, 40, 40), float32] */;
  %71 = nn.bias_add(%70, meta[relay.Constant][40] /* ty=Tensor[(192), float32] */) /* ty=Tensor[(1, 192, 40, 40), float32] */;
  %72 = maximum(%71, 0f /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */) /* ty=Tensor[(1, 192, 40, 40), float32] */;
  %73 = minimum(%72, 6f /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */) /* ty=Tensor[(1, 192, 40, 40), float32] */;
  %74 = nn.conv2d(%73, meta[relay.Constant][41] /* ty=Tensor[(192, 1, 3, 3), float32] */, padding=[1, 1, 1, 1], groups=192, kernel_size=[3, 3]) /* ty=Tensor[(1, 192, 40, 40), float32] */;
  %75 = nn.bias_add(%74, meta[relay.Constant][42] /* ty=Tensor[(192), float32] */) /* ty=Tensor[(1, 192, 40, 40), float32] */;
  %76 = maximum(%75, 0f /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */) /* ty=Tensor[(1, 192, 40, 40), float32] */;
  %77 = minimum(%76, 6f /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */) /* ty=Tensor[(1, 192, 40, 40), float32] */;
  %78 = nn.conv2d(%77, meta[relay.Constant][43] /* ty=Tensor[(32, 192, 1, 1), float32] */, padding=[0, 0, 0, 0], kernel_size=[1, 1]) /* ty=Tensor[(1, 32, 40, 40), float32] */;
  %79 = nn.bias_add(%78, meta[relay.Constant][44] /* ty=Tensor[(32), float32] */) /* ty=Tensor[(1, 32, 40, 40), float32] */;
  %80 = add(%69, %79) /* ty=Tensor[(1, 32, 40, 40), float32] */;
  %81 = nn.conv2d(%80, meta[relay.Constant][45] /* ty=Tensor[(192, 32, 1, 1), float32] */, padding=[0, 0, 0, 0], kernel_size=[1, 1]) /* ty=Tensor[(1, 192, 40, 40), float32] */;
  %82 = nn.bias_add(%81, meta[relay.Constant][46] /* ty=Tensor[(192), float32] */) /* ty=Tensor[(1, 192, 40, 40), float32] */;
  %83 = maximum(%82, 0f /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */) /* ty=Tensor[(1, 192, 40, 40), float32] */;
  %84 = minimum(%83, 6f /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */) /* ty=Tensor[(1, 192, 40, 40), float32] */;
  %85 = nn.conv2d(%84, meta[relay.Constant][47] /* ty=Tensor[(192, 1, 3, 3), float32] */, strides=[2, 2], padding=[0, 0, 1, 1], groups=192, kernel_size=[3, 3]) /* ty=Tensor[(1, 192, 20, 20), float32] */;
  %86 = nn.bias_add(%85, meta[relay.Constant][48] /* ty=Tensor[(192), float32] */) /* ty=Tensor[(1, 192, 20, 20), float32] */;
  %87 = maximum(%86, 0f /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */) /* ty=Tensor[(1, 192, 20, 20), float32] */;
  %88 = minimum(%87, 6f /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */) /* ty=Tensor[(1, 192, 20, 20), float32] */;
  %89 = nn.conv2d(%88, meta[relay.Constant][49] /* ty=Tensor[(64, 192, 1, 1), float32] */, padding=[0, 0, 0, 0], kernel_size=[1, 1]) /* ty=Tensor[(1, 64, 20, 20), float32] */;
  %90 = nn.bias_add(%89, meta[relay.Constant][50] /* ty=Tensor[(64), float32] */) /* ty=Tensor[(1, 64, 20, 20), float32] */;
  %91 = nn.conv2d(%90, meta[relay.Constant][51] /* ty=Tensor[(384, 64, 1, 1), float32] */, padding=[0, 0, 0, 0], kernel_size=[1, 1]) /* ty=Tensor[(1, 384, 20, 20), float32] */;
  %92 = nn.batch_norm(%91, meta[relay.Constant][52] /* ty=Tensor[(384), float32] */, meta[relay.Constant][53] /* ty=Tensor[(384), float32] */, meta[relay.Constant][54] /* ty=Tensor[(384), float32] */, meta[relay.Constant][55] /* ty=Tensor[(384), float32] */, epsilon=0.001f) /* ty=(Tensor[(1, 384, 20, 20), float32], Tensor[(384), float32], Tensor[(384), float32]) */;
  %93 = %92.0;
  %94 = maximum(%93, 0f /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */) /* ty=Tensor[(1, 384, 20, 20), float32] */;
  %95 = minimum(%94, 6f /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */) /* ty=Tensor[(1, 384, 20, 20), float32] */;
  %96 = nn.conv2d(%95, meta[relay.Constant][56] /* ty=Tensor[(384, 1, 3, 3), float32] */, padding=[1, 1, 1, 1], groups=384, kernel_size=[3, 3]) /* ty=Tensor[(1, 384, 20, 20), float32] */;
  %97 = nn.bias_add(%96, meta[relay.Constant][57] /* ty=Tensor[(384), float32] */) /* ty=Tensor[(1, 384, 20, 20), float32] */;
  %98 = maximum(%97, 0f /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */) /* ty=Tensor[(1, 384, 20, 20), float32] */;
  %99 = minimum(%98, 6f /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */) /* ty=Tensor[(1, 384, 20, 20), float32] */;
  %100 = nn.conv2d(%99, meta[relay.Constant][58] /* ty=Tensor[(64, 384, 1, 1), float32] */, padding=[0, 0, 0, 0], kernel_size=[1, 1]) /* ty=Tensor[(1, 64, 20, 20), float32] */;
  %101 = nn.bias_add(%100, meta[relay.Constant][59] /* ty=Tensor[(64), float32] */) /* ty=Tensor[(1, 64, 20, 20), float32] */;
  %102 = add(%90, %101) /* ty=Tensor[(1, 64, 20, 20), float32] */;
  %103 = nn.conv2d(%102, meta[relay.Constant][60] /* ty=Tensor[(384, 64, 1, 1), float32] */, padding=[0, 0, 0, 0], kernel_size=[1, 1]) /* ty=Tensor[(1, 384, 20, 20), float32] */;
  %104 = nn.bias_add(%103, meta[relay.Constant][61] /* ty=Tensor[(384), float32] */) /* ty=Tensor[(1, 384, 20, 20), float32] */;
  %105 = maximum(%104, 0f /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */) /* ty=Tensor[(1, 384, 20, 20), float32] */;
  %106 = minimum(%105, 6f /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */) /* ty=Tensor[(1, 384, 20, 20), float32] */;
  %107 = nn.conv2d(%106, meta[relay.Constant][62] /* ty=Tensor[(384, 1, 3, 3), float32] */, padding=[1, 1, 1, 1], groups=384, kernel_size=[3, 3]) /* ty=Tensor[(1, 384, 20, 20), float32] */;
  %108 = nn.bias_add(%107, meta[relay.Constant][63] /* ty=Tensor[(384), float32] */) /* ty=Tensor[(1, 384, 20, 20), float32] */;
  %109 = maximum(%108, 0f /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */) /* ty=Tensor[(1, 384, 20, 20), float32] */;
  %110 = minimum(%109, 6f /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */) /* ty=Tensor[(1, 384, 20, 20), float32] */;
  %111 = nn.conv2d(%110, meta[relay.Constant][64] /* ty=Tensor[(64, 384, 1, 1), float32] */, padding=[0, 0, 0, 0], kernel_size=[1, 1]) /* ty=Tensor[(1, 64, 20, 20), float32] */;
  %112 = nn.bias_add(%111, meta[relay.Constant][65] /* ty=Tensor[(64), float32] */) /* ty=Tensor[(1, 64, 20, 20), float32] */;
  %113 = add(%102, %112) /* ty=Tensor[(1, 64, 20, 20), float32] */;
  %114 = nn.conv2d(%113, meta[relay.Constant][66] /* ty=Tensor[(384, 64, 1, 1), float32] */, padding=[0, 0, 0, 0], kernel_size=[1, 1]) /* ty=Tensor[(1, 384, 20, 20), float32] */;
  %115 = nn.bias_add(%114, meta[relay.Constant][67] /* ty=Tensor[(384), float32] */) /* ty=Tensor[(1, 384, 20, 20), float32] */;
  %116 = maximum(%115, 0f /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */) /* ty=Tensor[(1, 384, 20, 20), float32] */;
  %117 = minimum(%116, 6f /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */) /* ty=Tensor[(1, 384, 20, 20), float32] */;
  %118 = nn.conv2d(%117, meta[relay.Constant][68] /* ty=Tensor[(384, 1, 3, 3), float32] */, padding=[1, 1, 1, 1], groups=384, kernel_size=[3, 3]) /* ty=Tensor[(1, 384, 20, 20), float32] */;
  %119 = nn.bias_add(%118, meta[relay.Constant][69] /* ty=Tensor[(384), float32] */) /* ty=Tensor[(1, 384, 20, 20), float32] */;
  %120 = maximum(%119, 0f /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */) /* ty=Tensor[(1, 384, 20, 20), float32] */;
  %121 = minimum(%120, 6f /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */) /* ty=Tensor[(1, 384, 20, 20), float32] */;
  %122 = nn.conv2d(%121, meta[relay.Constant][70] /* ty=Tensor[(64, 384, 1, 1), float32] */, padding=[0, 0, 0, 0], kernel_size=[1, 1]) /* ty=Tensor[(1, 64, 20, 20), float32] */;
  %123 = nn.bias_add(%122, meta[relay.Constant][71] /* ty=Tensor[(64), float32] */) /* ty=Tensor[(1, 64, 20, 20), float32] */;
  %124 = add(%113, %123) /* ty=Tensor[(1, 64, 20, 20), float32] */;
  %125 = nn.conv2d(%124, meta[relay.Constant][72] /* ty=Tensor[(384, 64, 1, 1), float32] */, padding=[0, 0, 0, 0], kernel_size=[1, 1]) /* ty=Tensor[(1, 384, 20, 20), float32] */;
  %126 = nn.bias_add(%125, meta[relay.Constant][73] /* ty=Tensor[(384), float32] */) /* ty=Tensor[(1, 384, 20, 20), float32] */;
  %127 = maximum(%126, 0f /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */) /* ty=Tensor[(1, 384, 20, 20), float32] */;
  %128 = minimum(%127, 6f /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */) /* ty=Tensor[(1, 384, 20, 20), float32] */;
  %129 = nn.conv2d(%128, meta[relay.Constant][74] /* ty=Tensor[(384, 1, 3, 3), float32] */, padding=[1, 1, 1, 1], groups=384, kernel_size=[3, 3]) /* ty=Tensor[(1, 384, 20, 20), float32] */;
  %130 = nn.bias_add(%129, meta[relay.Constant][75] /* ty=Tensor[(384), float32] */) /* ty=Tensor[(1, 384, 20, 20), float32] */;
  %131 = maximum(%130, 0f /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */) /* ty=Tensor[(1, 384, 20, 20), float32] */;
  %132 = minimum(%131, 6f /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */) /* ty=Tensor[(1, 384, 20, 20), float32] */;
  %133 = nn.conv2d(%132, meta[relay.Constant][76] /* ty=Tensor[(96, 384, 1, 1), float32] */, padding=[0, 0, 0, 0], kernel_size=[1, 1]) /* ty=Tensor[(1, 96, 20, 20), float32] */;
  %134 = nn.bias_add(%133, meta[relay.Constant][77] /* ty=Tensor[(96), float32] */) /* ty=Tensor[(1, 96, 20, 20), float32] */;
  %135 = nn.conv2d(%134, meta[relay.Constant][78] /* ty=Tensor[(576, 96, 1, 1), float32] */, padding=[0, 0, 0, 0], kernel_size=[1, 1]) /* ty=Tensor[(1, 576, 20, 20), float32] */;
  %136 = nn.batch_norm(%135, meta[relay.Constant][79] /* ty=Tensor[(576), float32] */, meta[relay.Constant][80] /* ty=Tensor[(576), float32] */, meta[relay.Constant][81] /* ty=Tensor[(576), float32] */, meta[relay.Constant][82] /* ty=Tensor[(576), float32] */, epsilon=0.001f) /* ty=(Tensor[(1, 576, 20, 20), float32], Tensor[(576), float32], Tensor[(576), float32]) */;
  %137 = %136.0;
  %138 = maximum(%137, 0f /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */) /* ty=Tensor[(1, 576, 20, 20), float32] */;
  %139 = minimum(%138, 6f /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */) /* ty=Tensor[(1, 576, 20, 20), float32] */;
  %140 = nn.conv2d(%139, meta[relay.Constant][83] /* ty=Tensor[(576, 1, 3, 3), float32] */, padding=[1, 1, 1, 1], groups=576, kernel_size=[3, 3]) /* ty=Tensor[(1, 576, 20, 20), float32] */;
  %141 = nn.bias_add(%140, meta[relay.Constant][84] /* ty=Tensor[(576), float32] */) /* ty=Tensor[(1, 576, 20, 20), float32] */;
  %142 = maximum(%141, 0f /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */) /* ty=Tensor[(1, 576, 20, 20), float32] */;
  %143 = minimum(%142, 6f /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */) /* ty=Tensor[(1, 576, 20, 20), float32] */;
  %144 = nn.conv2d(%143, meta[relay.Constant][85] /* ty=Tensor[(96, 576, 1, 1), float32] */, padding=[0, 0, 0, 0], kernel_size=[1, 1]) /* ty=Tensor[(1, 96, 20, 20), float32] */;
  %145 = nn.bias_add(%144, meta[relay.Constant][86] /* ty=Tensor[(96), float32] */) /* ty=Tensor[(1, 96, 20, 20), float32] */;
  %146 = add(%134, %145) /* ty=Tensor[(1, 96, 20, 20), float32] */;
  %147 = nn.conv2d(%146, meta[relay.Constant][87] /* ty=Tensor[(576, 96, 1, 1), float32] */, padding=[0, 0, 0, 0], kernel_size=[1, 1]) /* ty=Tensor[(1, 576, 20, 20), float32] */;
  %148 = nn.bias_add(%147, meta[relay.Constant][88] /* ty=Tensor[(576), float32] */) /* ty=Tensor[(1, 576, 20, 20), float32] */;
  %149 = maximum(%148, 0f /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */) /* ty=Tensor[(1, 576, 20, 20), float32] */;
  %150 = minimum(%149, 6f /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */) /* ty=Tensor[(1, 576, 20, 20), float32] */;
  %151 = nn.conv2d(%150, meta[relay.Constant][89] /* ty=Tensor[(576, 1, 3, 3), float32] */, padding=[1, 1, 1, 1], groups=576, kernel_size=[3, 3]) /* ty=Tensor[(1, 576, 20, 20), float32] */;
  %152 = nn.bias_add(%151, meta[relay.Constant][90] /* ty=Tensor[(576), float32] */) /* ty=Tensor[(1, 576, 20, 20), float32] */;
  %153 = maximum(%152, 0f /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */) /* ty=Tensor[(1, 576, 20, 20), float32] */;
  %154 = minimum(%153, 6f /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */) /* ty=Tensor[(1, 576, 20, 20), float32] */;
  %155 = nn.conv2d(%154, meta[relay.Constant][91] /* ty=Tensor[(96, 576, 1, 1), float32] */, padding=[0, 0, 0, 0], kernel_size=[1, 1]) /* ty=Tensor[(1, 96, 20, 20), float32] */;
  %156 = nn.bias_add(%155, meta[relay.Constant][92] /* ty=Tensor[(96), float32] */) /* ty=Tensor[(1, 96, 20, 20), float32] */;
  %157 = add(%146, %156) /* ty=Tensor[(1, 96, 20, 20), float32] */;
  %158 = nn.conv2d(%157, meta[relay.Constant][93] /* ty=Tensor[(576, 96, 1, 1), float32] */, padding=[0, 0, 0, 0], kernel_size=[1, 1]) /* ty=Tensor[(1, 576, 20, 20), float32] */;
  %159 = nn.bias_add(%158, meta[relay.Constant][94] /* ty=Tensor[(576), float32] */) /* ty=Tensor[(1, 576, 20, 20), float32] */;
  %160 = maximum(%159, 0f /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */) /* ty=Tensor[(1, 576, 20, 20), float32] */;
  %161 = minimum(%160, 6f /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */) /* ty=Tensor[(1, 576, 20, 20), float32] */;
  %162 = nn.conv2d(%161, meta[relay.Constant][95] /* ty=Tensor[(576, 1, 3, 3), float32] */, strides=[2, 2], padding=[0, 0, 1, 1], groups=576, kernel_size=[3, 3]) /* ty=Tensor[(1, 576, 10, 10), float32] */;
  %163 = nn.bias_add(%162, meta[relay.Constant][96] /* ty=Tensor[(576), float32] */) /* ty=Tensor[(1, 576, 10, 10), float32] */;
  %164 = maximum(%163, 0f /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */) /* ty=Tensor[(1, 576, 10, 10), float32] */;
  %165 = minimum(%164, 6f /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */) /* ty=Tensor[(1, 576, 10, 10), float32] */;
  %166 = nn.conv2d(%165, meta[relay.Constant][97] /* ty=Tensor[(160, 576, 1, 1), float32] */, padding=[0, 0, 0, 0], kernel_size=[1, 1]) /* ty=Tensor[(1, 160, 10, 10), float32] */;
  %167 = nn.bias_add(%166, meta[relay.Constant][98] /* ty=Tensor[(160), float32] */) /* ty=Tensor[(1, 160, 10, 10), float32] */;
  %168 = nn.conv2d(%167, meta[relay.Constant][99] /* ty=Tensor[(960, 160, 1, 1), float32] */, padding=[0, 0, 0, 0], kernel_size=[1, 1]) /* ty=Tensor[(1, 960, 10, 10), float32] */;
  %169 = nn.batch_norm(%168, meta[relay.Constant][100] /* ty=Tensor[(960), float32] */, meta[relay.Constant][101] /* ty=Tensor[(960), float32] */, meta[relay.Constant][102] /* ty=Tensor[(960), float32] */, meta[relay.Constant][103] /* ty=Tensor[(960), float32] */, epsilon=0.001f) /* ty=(Tensor[(1, 960, 10, 10), float32], Tensor[(960), float32], Tensor[(960), float32]) */;
  %170 = %169.0;
  %171 = maximum(%170, 0f /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */) /* ty=Tensor[(1, 960, 10, 10), float32] */;
  %172 = minimum(%171, 6f /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */) /* ty=Tensor[(1, 960, 10, 10), float32] */;
  %173 = nn.conv2d(%172, meta[relay.Constant][104] /* ty=Tensor[(960, 1, 3, 3), float32] */, padding=[1, 1, 1, 1], groups=960, kernel_size=[3, 3]) /* ty=Tensor[(1, 960, 10, 10), float32] */;
  %174 = nn.bias_add(%173, meta[relay.Constant][105] /* ty=Tensor[(960), float32] */) /* ty=Tensor[(1, 960, 10, 10), float32] */;
  %175 = maximum(%174, 0f /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */) /* ty=Tensor[(1, 960, 10, 10), float32] */;
  %176 = minimum(%175, 6f /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */) /* ty=Tensor[(1, 960, 10, 10), float32] */;
  %177 = nn.conv2d(%176, meta[relay.Constant][106] /* ty=Tensor[(160, 960, 1, 1), float32] */, padding=[0, 0, 0, 0], kernel_size=[1, 1]) /* ty=Tensor[(1, 160, 10, 10), float32] */;
  %178 = nn.bias_add(%177, meta[relay.Constant][107] /* ty=Tensor[(160), float32] */) /* ty=Tensor[(1, 160, 10, 10), float32] */;
  %179 = add(%167, %178) /* ty=Tensor[(1, 160, 10, 10), float32] */;
  %180 = nn.conv2d(%179, meta[relay.Constant][108] /* ty=Tensor[(960, 160, 1, 1), float32] */, padding=[0, 0, 0, 0], kernel_size=[1, 1]) /* ty=Tensor[(1, 960, 10, 10), float32] */;
  %181 = nn.bias_add(%180, meta[relay.Constant][109] /* ty=Tensor[(960), float32] */) /* ty=Tensor[(1, 960, 10, 10), float32] */;
  %182 = maximum(%181, 0f /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */) /* ty=Tensor[(1, 960, 10, 10), float32] */;
  %183 = minimum(%182, 6f /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */) /* ty=Tensor[(1, 960, 10, 10), float32] */;
  %184 = nn.conv2d(%183, meta[relay.Constant][110] /* ty=Tensor[(960, 1, 3, 3), float32] */, padding=[1, 1, 1, 1], groups=960, kernel_size=[3, 3]) /* ty=Tensor[(1, 960, 10, 10), float32] */;
  %185 = nn.bias_add(%184, meta[relay.Constant][111] /* ty=Tensor[(960), float32] */) /* ty=Tensor[(1, 960, 10, 10), float32] */;
  %186 = maximum(%185, 0f /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */) /* ty=Tensor[(1, 960, 10, 10), float32] */;
  %187 = minimum(%186, 6f /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */) /* ty=Tensor[(1, 960, 10, 10), float32] */;
  %188 = nn.conv2d(%187, meta[relay.Constant][112] /* ty=Tensor[(160, 960, 1, 1), float32] */, padding=[0, 0, 0, 0], kernel_size=[1, 1]) /* ty=Tensor[(1, 160, 10, 10), float32] */;
  %189 = nn.bias_add(%188, meta[relay.Constant][113] /* ty=Tensor[(160), float32] */) /* ty=Tensor[(1, 160, 10, 10), float32] */;
  %190 = add(%179, %189) /* ty=Tensor[(1, 160, 10, 10), float32] */;
  %191 = nn.conv2d(%190, meta[relay.Constant][114] /* ty=Tensor[(960, 160, 1, 1), float32] */, padding=[0, 0, 0, 0], kernel_size=[1, 1]) /* ty=Tensor[(1, 960, 10, 10), float32] */;
  %192 = nn.bias_add(%191, meta[relay.Constant][115] /* ty=Tensor[(960), float32] */) /* ty=Tensor[(1, 960, 10, 10), float32] */;
  %193 = maximum(%192, 0f /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */) /* ty=Tensor[(1, 960, 10, 10), float32] */;
  %194 = minimum(%193, 6f /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */) /* ty=Tensor[(1, 960, 10, 10), float32] */;
  %195 = nn.conv2d(%194, meta[relay.Constant][116] /* ty=Tensor[(960, 1, 3, 3), float32] */, padding=[1, 1, 1, 1], groups=960, kernel_size=[3, 3]) /* ty=Tensor[(1, 960, 10, 10), float32] */;
  %196 = nn.bias_add(%195, meta[relay.Constant][117] /* ty=Tensor[(960), float32] */) /* ty=Tensor[(1, 960, 10, 10), float32] */;
  %197 = maximum(%196, 0f /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */) /* ty=Tensor[(1, 960, 10, 10), float32] */;
  %198 = minimum(%197, 6f /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */) /* ty=Tensor[(1, 960, 10, 10), float32] */;
  %199 = nn.conv2d(%198, meta[relay.Constant][118] /* ty=Tensor[(320, 960, 1, 1), float32] */, padding=[0, 0, 0, 0], kernel_size=[1, 1]) /* ty=Tensor[(1, 320, 10, 10), float32] */;
  %200 = nn.bias_add(%199, meta[relay.Constant][119] /* ty=Tensor[(320), float32] */) /* ty=Tensor[(1, 320, 10, 10), float32] */;
  %201 = nn.conv2d(%200, meta[relay.Constant][120] /* ty=Tensor[(1280, 320, 1, 1), float32] */, padding=[0, 0, 0, 0], kernel_size=[1, 1]) /* ty=Tensor[(1, 1280, 10, 10), float32] */;
  %202 = nn.batch_norm(%201, meta[relay.Constant][121] /* ty=Tensor[(1280), float32] */, meta[relay.Constant][122] /* ty=Tensor[(1280), float32] */, meta[relay.Constant][123] /* ty=Tensor[(1280), float32] */, meta[relay.Constant][124] /* ty=Tensor[(1280), float32] */, epsilon=0.001f) /* ty=(Tensor[(1, 1280, 10, 10), float32], Tensor[(1280), float32], Tensor[(1280), float32]) */;
  %203 = %202.0;
  %204 = maximum(%203, 0f /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */) /* ty=Tensor[(1, 1280, 10, 10), float32] */;
  %205 = minimum(%204, 6f /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */) /* ty=Tensor[(1, 1280, 10, 10), float32] */;
  %206 = nn.conv2d(%205, meta[relay.Constant][125] /* ty=Tensor[(128, 1280, 1, 1), float32] */, padding=[0, 0, 0, 0], kernel_size=[1, 1]) /* ty=Tensor[(1, 128, 10, 10), float32] */;
  %207 = nn.bias_add(%206, meta[relay.Constant][126] /* ty=Tensor[(128), float32] */) /* ty=Tensor[(1, 128, 10, 10), float32] */;
  %208 = expand_dims(%207, axis=1) /* ty=Tensor[(1, 1, 128, 10, 10), float32] */;
  %209 = (%208, %208);
  %210 = concatenate(%209, axis=1) /* ty=Tensor[(1, 2, 128, 10, 10), float32] */;
  %211 = expand_dims(%210, axis=4) /* ty=Tensor[(1, 2, 128, 10, 1, 10), float32] */;
  %212 = (%211, %211);
  %213 = concatenate(%212, axis=4) /* ty=Tensor[(1, 2, 128, 10, 2, 10), float32] */;
  %214 = transpose(%213, axes=[0, 3, 4, 5, 1, 2]) /* ty=Tensor[(1, 10, 2, 10, 2, 128), float32] */;
  %215 = reshape(%214, newshape=[1, 20, 20, 128]) /* ty=Tensor[(1, 20, 20, 128), float32] */;
  %216 = nn.conv2d(%157, meta[relay.Constant][127] /* ty=Tensor[(128, 96, 1, 1), float32] */, padding=[0, 0, 0, 0], kernel_size=[1, 1]) /* ty=Tensor[(1, 128, 20, 20), float32] */;
  %217 = transpose(%215, axes=[0, 3, 1, 2]) /* ty=Tensor[(1, 128, 20, 20), float32] */;
  %218 = nn.bias_add(%216, meta[relay.Constant][128] /* ty=Tensor[(128), float32] */) /* ty=Tensor[(1, 128, 20, 20), float32] */;
  %219 = add(%217, %218) /* ty=Tensor[(1, 128, 20, 20), float32] */;
  %220 = nn.conv2d(%219, meta[relay.Constant][129] /* ty=Tensor[(128, 1, 3, 3), float32] */, padding=[1, 1, 1, 1], groups=128, kernel_size=[3, 3]) /* ty=Tensor[(1, 128, 20, 20), float32] */;
  %221 = nn.conv2d(%220, meta[relay.Constant][130] /* ty=Tensor[(128, 128, 1, 1), float32] */, padding=[0, 0, 0, 0], kernel_size=[1, 1]) /* ty=Tensor[(1, 128, 20, 20), float32] */;
  %222 = nn.batch_norm(%221, meta[relay.Constant][131] /* ty=Tensor[(128), float32] */, meta[relay.Constant][132] /* ty=Tensor[(128), float32] */, meta[relay.Constant][133] /* ty=Tensor[(128), float32] */, meta[relay.Constant][134] /* ty=Tensor[(128), float32] */, epsilon=0.001f) /* ty=(Tensor[(1, 128, 20, 20), float32], Tensor[(128), float32], Tensor[(128), float32]) */;
  %223 = %222.0;
  %224 = maximum(%223, 0f /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */ /* ty=float32 */) /* ty=Tensor[(1, 128, 20, 20), float32] */;
