def @main(%serving_default_input:0: Tensor[(1, 256, 256, 3), uint8]) -> Tensor[(1, 1, 17, 3), float32] {
  %0 = cast(%serving_default_input:0, dtype="float32") /* ty=Tensor[(1, 256, 256, 3), float32] */;
  %1 = qnn.quantize(%0, 1f /* ty=float32 */, -128 /* ty=int32 */, out_dtype="int8", axis=1) /* ty=Tensor[(1, 256, 256, 3), int8] */;
  %2 = qnn.subtract(%1, meta[relay.Constant][0] /* ty=Tensor[(1, 1, 1, 3), int8] */, 1f /* ty=float32 */, -128 /* ty=int32 */, 1e-06f /* ty=float32 */, 0 /* ty=int32 */, 1f /* ty=float32 */, -128 /* ty=int32 */) /* ty=Tensor[(1, 256, 256, 3), int8] */;
  %3 = qnn.mul(%2, meta[relay.Constant][1] /* ty=int8 */, 1f /* ty=float32 */, -128 /* ty=int32 */, 3.07574e-05f /* ty=float32 */, -128 /* ty=int32 */, 0.00784314f /* ty=float32 */, -128 /* ty=int32 */) /* ty=Tensor[(1, 256, 256, 3), int8] */;
  %4 = qnn.subtract(%3, meta[relay.Constant][1] /* ty=int8 */, 0.00784314f /* ty=float32 */, -128 /* ty=int32 */, 0.00392157f /* ty=float32 */, -128 /* ty=int32 */, 0.00784314f /* ty=float32 */, -1 /* ty=int32 */) /* ty=Tensor[(1, 256, 256, 3), int8] */;
  %5 = transpose(%4, axes=[0, 3, 1, 2]) /* ty=Tensor[(1, 3, 256, 256), int8] */;
  %6 = qnn.conv2d(%5, meta[relay.Constant][2] /* ty=Tensor[(56, 3, 3, 3), int8] */, -1 /* ty=int32 */, meta[relay.Constant][3] /* ty=Tensor[(56), int32] */, 0.00784314f /* ty=float32 */, meta[relay.Constant][4] /* ty=Tensor[(56), float32] */, strides=[2, 2], padding=[0, 0, 1, 1], channels=56, kernel_size=[3, 3], out_dtype="int32") /* ty=Tensor[(1, 56, 128, 128), int32] */;
  %7 = nn.bias_add(%6, meta[relay.Constant][5] /* ty=Tensor[(56), int32] */) /* ty=Tensor[(1, 56, 128, 128), int32] */;
  %8 = qnn.quantize(meta[relay.Constant][6] /* ty=Tensor[(1, 56, 1, 1), float32] */, meta[relay.Constant][7] /* ty=Tensor[(56), float32] */, meta[relay.Constant][8] /* ty=Tensor[(56), int32] */, out_dtype="int32", axis=1) /* ty=Tensor[(1, 56, 1, 1), int32] */;
  %9 = maximum(%7, %8) /* ty=Tensor[(1, 56, 128, 128), int32] */;
  %10 = qnn.quantize(meta[relay.Constant][9] /* ty=Tensor[(1, 56, 1, 1), float32] */, meta[relay.Constant][7] /* ty=Tensor[(56), float32] */, meta[relay.Constant][8] /* ty=Tensor[(56), int32] */, out_dtype="int32", axis=1) /* ty=Tensor[(1, 56, 1, 1), int32] */;
  %11 = minimum(%9, %10) /* ty=Tensor[(1, 56, 128, 128), int32] */;
  %12 = qnn.requantize(%11, meta[relay.Constant][7] /* ty=Tensor[(56), float32] */, meta[relay.Constant][8] /* ty=Tensor[(56), int32] */, 0.0235294f /* ty=float32 */, -128 /* ty=int32 */, axis=1, out_dtype="int8") /* ty=Tensor[(1, 56, 128, 128), int8] */;
  %13 = qnn.conv2d(%12, meta[relay.Constant][10] /* ty=Tensor[(56, 1, 3, 3), int8] */, -128 /* ty=int32 */, meta[relay.Constant][11] /* ty=Tensor[(56), int32] */, 0.0235294f /* ty=float32 */, meta[relay.Constant][12] /* ty=Tensor[(56), float32] */, padding=[1, 1, 1, 1], groups=56, channels=56, kernel_size=[3, 3], out_dtype="int32") /* ty=Tensor[(1, 56, 128, 128), int32] */;
  %14 = nn.bias_add(%13, meta[relay.Constant][13] /* ty=Tensor[(56), int32] */) /* ty=Tensor[(1, 56, 128, 128), int32] */;
  %15 = qnn.quantize(meta[relay.Constant][14] /* ty=Tensor[(1, 56, 1, 1), float32] */, meta[relay.Constant][15] /* ty=Tensor[(56), float32] */, meta[relay.Constant][16] /* ty=Tensor[(56), int32] */, out_dtype="int32", axis=1) /* ty=Tensor[(1, 56, 1, 1), int32] */;
  %16 = maximum(%14, %15) /* ty=Tensor[(1, 56, 128, 128), int32] */;
  %17 = qnn.quantize(meta[relay.Constant][17] /* ty=Tensor[(1, 56, 1, 1), float32] */, meta[relay.Constant][15] /* ty=Tensor[(56), float32] */, meta[relay.Constant][16] /* ty=Tensor[(56), int32] */, out_dtype="int32", axis=1) /* ty=Tensor[(1, 56, 1, 1), int32] */;
  %18 = minimum(%16, %17) /* ty=Tensor[(1, 56, 128, 128), int32] */;
  %19 = qnn.requantize(%18, meta[relay.Constant][15] /* ty=Tensor[(56), float32] */, meta[relay.Constant][16] /* ty=Tensor[(56), int32] */, 0.0235294f /* ty=float32 */, -128 /* ty=int32 */, axis=1, out_dtype="int8") /* ty=Tensor[(1, 56, 128, 128), int8] */;
  %20 = qnn.conv2d(%19, meta[relay.Constant][18] /* ty=Tensor[(32, 56, 1, 1), int8] */, -128 /* ty=int32 */, meta[relay.Constant][19] /* ty=Tensor[(32), int32] */, 0.0235294f /* ty=float32 */, meta[relay.Constant][20] /* ty=Tensor[(32), float32] */, padding=[0, 0, 0, 0], channels=32, kernel_size=[1, 1], out_dtype="int32") /* ty=Tensor[(1, 32, 128, 128), int32] */;
  %21 = nn.bias_add(%20, meta[relay.Constant][21] /* ty=Tensor[(32), int32] */) /* ty=Tensor[(1, 32, 128, 128), int32] */;
  %22 = qnn.requantize(%21, meta[relay.Constant][22] /* ty=Tensor[(32), float32] */, meta[relay.Constant][23] /* ty=Tensor[(32), int32] */, 0.327041f /* ty=float32 */, 14 /* ty=int32 */, axis=1, out_dtype="int8") /* ty=Tensor[(1, 32, 128, 128), int8] */;
  %23 = qnn.conv2d(%22, meta[relay.Constant][24] /* ty=Tensor[(192, 32, 1, 1), int8] */, 14 /* ty=int32 */, meta[relay.Constant][25] /* ty=Tensor[(192), int32] */, 0.327041f /* ty=float32 */, meta[relay.Constant][26] /* ty=Tensor[(192), float32] */, padding=[0, 0, 0, 0], channels=192, kernel_size=[1, 1], out_dtype="int32") /* ty=Tensor[(1, 192, 128, 128), int32] */;
  %24 = nn.bias_add(%23, meta[relay.Constant][27] /* ty=Tensor[(192), int32] */) /* ty=Tensor[(1, 192, 128, 128), int32] */;
  %25 = qnn.quantize(meta[relay.Constant][28] /* ty=Tensor[(1, 192, 1, 1), float32] */, meta[relay.Constant][29] /* ty=Tensor[(192), float32] */, meta[relay.Constant][30] /* ty=Tensor[(192), int32] */, out_dtype="int32", axis=1) /* ty=Tensor[(1, 192, 1, 1), int32] */;
  %26 = maximum(%24, %25) /* ty=Tensor[(1, 192, 128, 128), int32] */;
  %27 = qnn.quantize(meta[relay.Constant][31] /* ty=Tensor[(1, 192, 1, 1), float32] */, meta[relay.Constant][29] /* ty=Tensor[(192), float32] */, meta[relay.Constant][30] /* ty=Tensor[(192), int32] */, out_dtype="int32", axis=1) /* ty=Tensor[(1, 192, 1, 1), int32] */;
  %28 = minimum(%26, %27) /* ty=Tensor[(1, 192, 128, 128), int32] */;
  %29 = qnn.requantize(%28, meta[relay.Constant][29] /* ty=Tensor[(192), float32] */, meta[relay.Constant][30] /* ty=Tensor[(192), int32] */, 0.0235294f /* ty=float32 */, -128 /* ty=int32 */, axis=1, out_dtype="int8") /* ty=Tensor[(1, 192, 128, 128), int8] */;
  %30 = qnn.conv2d(%29, meta[relay.Constant][32] /* ty=Tensor[(192, 1, 3, 3), int8] */, -128 /* ty=int32 */, meta[relay.Constant][33] /* ty=Tensor[(192), int32] */, 0.0235294f /* ty=float32 */, meta[relay.Constant][34] /* ty=Tensor[(192), float32] */, strides=[2, 2], padding=[0, 0, 1, 1], groups=192, channels=192, kernel_size=[3, 3], out_dtype="int32") /* ty=Tensor[(1, 192, 64, 64), int32] */;
  %31 = nn.bias_add(%30, meta[relay.Constant][35] /* ty=Tensor[(192), int32] */) /* ty=Tensor[(1, 192, 64, 64), int32] */;
  %32 = qnn.quantize(meta[relay.Constant][36] /* ty=Tensor[(1, 192, 1, 1), float32] */, meta[relay.Constant][37] /* ty=Tensor[(192), float32] */, meta[relay.Constant][38] /* ty=Tensor[(192), int32] */, out_dtype="int32", axis=1) /* ty=Tensor[(1, 192, 1, 1), int32] */;
  %33 = maximum(%31, %32) /* ty=Tensor[(1, 192, 64, 64), int32] */;
  %34 = qnn.quantize(meta[relay.Constant][39] /* ty=Tensor[(1, 192, 1, 1), float32] */, meta[relay.Constant][37] /* ty=Tensor[(192), float32] */, meta[relay.Constant][38] /* ty=Tensor[(192), int32] */, out_dtype="int32", axis=1) /* ty=Tensor[(1, 192, 1, 1), int32] */;
  %35 = minimum(%33, %34) /* ty=Tensor[(1, 192, 64, 64), int32] */;
  %36 = qnn.requantize(%35, meta[relay.Constant][37] /* ty=Tensor[(192), float32] */, meta[relay.Constant][38] /* ty=Tensor[(192), int32] */, 0.0235294f /* ty=float32 */, -128 /* ty=int32 */, axis=1, out_dtype="int8") /* ty=Tensor[(1, 192, 64, 64), int8] */;
  %37 = qnn.conv2d(%36, meta[relay.Constant][40] /* ty=Tensor[(40, 192, 1, 1), int8] */, -128 /* ty=int32 */, meta[relay.Constant][41] /* ty=Tensor[(40), int32] */, 0.0235294f /* ty=float32 */, meta[relay.Constant][42] /* ty=Tensor[(40), float32] */, padding=[0, 0, 0, 0], channels=40, kernel_size=[1, 1], out_dtype="int32") /* ty=Tensor[(1, 40, 64, 64), int32] */;
  %38 = nn.bias_add(%37, meta[relay.Constant][43] /* ty=Tensor[(40), int32] */) /* ty=Tensor[(1, 40, 64, 64), int32] */;
  %39 = qnn.requantize(%38, meta[relay.Constant][44] /* ty=Tensor[(40), float32] */, meta[relay.Constant][45] /* ty=Tensor[(40), int32] */, 0.032934f /* ty=float32 */, -4 /* ty=int32 */, axis=1, out_dtype="int8") /* ty=Tensor[(1, 40, 64, 64), int8] */;
  %40 = qnn.conv2d(%39, meta[relay.Constant][46] /* ty=Tensor[(240, 40, 1, 1), int8] */, -4 /* ty=int32 */, meta[relay.Constant][47] /* ty=Tensor[(240), int32] */, 0.032934f /* ty=float32 */, meta[relay.Constant][48] /* ty=Tensor[(240), float32] */, padding=[0, 0, 0, 0], channels=240, kernel_size=[1, 1], out_dtype="int32") /* ty=Tensor[(1, 240, 64, 64), int32] */;
  %41 = nn.bias_add(%40, meta[relay.Constant][49] /* ty=Tensor[(240), int32] */) /* ty=Tensor[(1, 240, 64, 64), int32] */;
  %42 = qnn.quantize(meta[relay.Constant][50] /* ty=Tensor[(1, 240, 1, 1), float32] */, meta[relay.Constant][51] /* ty=Tensor[(240), float32] */, meta[relay.Constant][52] /* ty=Tensor[(240), int32] */, out_dtype="int32", axis=1) /* ty=Tensor[(1, 240, 1, 1), int32] */;
  %43 = maximum(%41, %42) /* ty=Tensor[(1, 240, 64, 64), int32] */;
  %44 = qnn.quantize(meta[relay.Constant][53] /* ty=Tensor[(1, 240, 1, 1), float32] */, meta[relay.Constant][51] /* ty=Tensor[(240), float32] */, meta[relay.Constant][52] /* ty=Tensor[(240), int32] */, out_dtype="int32", axis=1) /* ty=Tensor[(1, 240, 1, 1), int32] */;
  %45 = minimum(%43, %44) /* ty=Tensor[(1, 240, 64, 64), int32] */;
  %46 = qnn.requantize(%45, meta[relay.Constant][51] /* ty=Tensor[(240), float32] */, meta[relay.Constant][52] /* ty=Tensor[(240), int32] */, 0.0235294f /* ty=float32 */, -128 /* ty=int32 */, axis=1, out_dtype="int8") /* ty=Tensor[(1, 240, 64, 64), int8] */;
  %47 = qnn.conv2d(%46, meta[relay.Constant][54] /* ty=Tensor[(240, 1, 3, 3), int8] */, -128 /* ty=int32 */, meta[relay.Constant][55] /* ty=Tensor[(240), int32] */, 0.0235294f /* ty=float32 */, meta[relay.Constant][56] /* ty=Tensor[(240), float32] */, padding=[1, 1, 1, 1], groups=240, channels=240, kernel_size=[3, 3], out_dtype="int32") /* ty=Tensor[(1, 240, 64, 64), int32] */;
  %48 = nn.bias_add(%47, meta[relay.Constant][57] /* ty=Tensor[(240), int32] */) /* ty=Tensor[(1, 240, 64, 64), int32] */;
  %49 = qnn.quantize(meta[relay.Constant][58] /* ty=Tensor[(1, 240, 1, 1), float32] */, meta[relay.Constant][59] /* ty=Tensor[(240), float32] */, meta[relay.Constant][60] /* ty=Tensor[(240), int32] */, out_dtype="int32", axis=1) /* ty=Tensor[(1, 240, 1, 1), int32] */;
  %50 = maximum(%48, %49) /* ty=Tensor[(1, 240, 64, 64), int32] */;
  %51 = qnn.quantize(meta[relay.Constant][61] /* ty=Tensor[(1, 240, 1, 1), float32] */, meta[relay.Constant][59] /* ty=Tensor[(240), float32] */, meta[relay.Constant][60] /* ty=Tensor[(240), int32] */, out_dtype="int32", axis=1) /* ty=Tensor[(1, 240, 1, 1), int32] */;
  %52 = minimum(%50, %51) /* ty=Tensor[(1, 240, 64, 64), int32] */;
  %53 = qnn.requantize(%52, meta[relay.Constant][59] /* ty=Tensor[(240), float32] */, meta[relay.Constant][60] /* ty=Tensor[(240), int32] */, 0.0235294f /* ty=float32 */, -128 /* ty=int32 */, axis=1, out_dtype="int8") /* ty=Tensor[(1, 240, 64, 64), int8] */;
  %54 = qnn.conv2d(%53, meta[relay.Constant][62] /* ty=Tensor[(40, 240, 1, 1), int8] */, -128 /* ty=int32 */, meta[relay.Constant][63] /* ty=Tensor[(40), int32] */, 0.0235294f /* ty=float32 */, meta[relay.Constant][64] /* ty=Tensor[(40), float32] */, padding=[0, 0, 0, 0], channels=40, kernel_size=[1, 1], out_dtype="int32") /* ty=Tensor[(1, 40, 64, 64), int32] */;
  %55 = nn.bias_add(%54, meta[relay.Constant][65] /* ty=Tensor[(40), int32] */) /* ty=Tensor[(1, 40, 64, 64), int32] */;
  %56 = qnn.requantize(%55, meta[relay.Constant][66] /* ty=Tensor[(40), float32] */, meta[relay.Constant][67] /* ty=Tensor[(40), int32] */, 0.0362254f /* ty=float32 */, -3 /* ty=int32 */, axis=1, out_dtype="int8") /* ty=Tensor[(1, 40, 64, 64), int8] */;
  %57 = qnn.add(%39, %56, 0.032934f /* ty=float32 */, -4 /* ty=int32 */, 0.0362254f /* ty=float32 */, -3 /* ty=int32 */, 0.0575621f /* ty=float32 */, -16 /* ty=int32 */) /* ty=Tensor[(1, 40, 64, 64), int8] */;
  %58 = qnn.conv2d(%57, meta[relay.Constant][68] /* ty=Tensor[(240, 40, 1, 1), int8] */, -16 /* ty=int32 */, meta[relay.Constant][69] /* ty=Tensor[(240), int32] */, 0.0575621f /* ty=float32 */, meta[relay.Constant][70] /* ty=Tensor[(240), float32] */, padding=[0, 0, 0, 0], channels=240, kernel_size=[1, 1], out_dtype="int32") /* ty=Tensor[(1, 240, 64, 64), int32] */;
  %59 = nn.bias_add(%58, meta[relay.Constant][71] /* ty=Tensor[(240), int32] */) /* ty=Tensor[(1, 240, 64, 64), int32] */;
  %60 = qnn.quantize(meta[relay.Constant][72] /* ty=Tensor[(1, 240, 1, 1), float32] */, meta[relay.Constant][73] /* ty=Tensor[(240), float32] */, meta[relay.Constant][74] /* ty=Tensor[(240), int32] */, out_dtype="int32", axis=1) /* ty=Tensor[(1, 240, 1, 1), int32] */;
  %61 = maximum(%59, %60) /* ty=Tensor[(1, 240, 64, 64), int32] */;
  %62 = qnn.quantize(meta[relay.Constant][75] /* ty=Tensor[(1, 240, 1, 1), float32] */, meta[relay.Constant][73] /* ty=Tensor[(240), float32] */, meta[relay.Constant][74] /* ty=Tensor[(240), int32] */, out_dtype="int32", axis=1) /* ty=Tensor[(1, 240, 1, 1), int32] */;
  %63 = minimum(%61, %62) /* ty=Tensor[(1, 240, 64, 64), int32] */;
  %64 = qnn.requantize(%63, meta[relay.Constant][73] /* ty=Tensor[(240), float32] */, meta[relay.Constant][74] /* ty=Tensor[(240), int32] */, 0.0235294f /* ty=float32 */, -128 /* ty=int32 */, axis=1, out_dtype="int8") /* ty=Tensor[(1, 240, 64, 64), int8] */;
  %65 = qnn.conv2d(%64, meta[relay.Constant][76] /* ty=Tensor[(240, 1, 3, 3), int8] */, -128 /* ty=int32 */, meta[relay.Constant][77] /* ty=Tensor[(240), int32] */, 0.0235294f /* ty=float32 */, meta[relay.Constant][78] /* ty=Tensor[(240), float32] */, strides=[2, 2], padding=[0, 0, 1, 1], groups=240, channels=240, kernel_size=[3, 3], out_dtype="int32") /* ty=Tensor[(1, 240, 32, 32), int32] */;
  %66 = nn.bias_add(%65, meta[relay.Constant][79] /* ty=Tensor[(240), int32] */) /* ty=Tensor[(1, 240, 32, 32), int32] */;
  %67 = qnn.quantize(meta[relay.Constant][80] /* ty=Tensor[(1, 240, 1, 1), float32] */, meta[relay.Constant][81] /* ty=Tensor[(240), float32] */, meta[relay.Constant][82] /* ty=Tensor[(240), int32] */, out_dtype="int32", axis=1) /* ty=Tensor[(1, 240, 1, 1), int32] */;
  %68 = maximum(%66, %67) /* ty=Tensor[(1, 240, 32, 32), int32] */;
  %69 = qnn.quantize(meta[relay.Constant][83] /* ty=Tensor[(1, 240, 1, 1), float32] */, meta[relay.Constant][81] /* ty=Tensor[(240), float32] */, meta[relay.Constant][82] /* ty=Tensor[(240), int32] */, out_dtype="int32", axis=1) /* ty=Tensor[(1, 240, 1, 1), int32] */;
  %70 = minimum(%68, %69) /* ty=Tensor[(1, 240, 32, 32), int32] */;
  %71 = qnn.requantize(%70, meta[relay.Constant][81] /* ty=Tensor[(240), float32] */, meta[relay.Constant][82] /* ty=Tensor[(240), int32] */, 0.0235294f /* ty=float32 */, -128 /* ty=int32 */, axis=1, out_dtype="int8") /* ty=Tensor[(1, 240, 32, 32), int8] */;
  %72 = qnn.conv2d(%71, meta[relay.Constant][84] /* ty=Tensor[(56, 240, 1, 1), int8] */, -128 /* ty=int32 */, meta[relay.Constant][85] /* ty=Tensor[(56), int32] */, 0.0235294f /* ty=float32 */, meta[relay.Constant][86] /* ty=Tensor[(56), float32] */, padding=[0, 0, 0, 0], channels=56, kernel_size=[1, 1], out_dtype="int32") /* ty=Tensor[(1, 56, 32, 32), int32] */;
  %73 = nn.bias_add(%72, meta[relay.Constant][87] /* ty=Tensor[(56), int32] */) /* ty=Tensor[(1, 56, 32, 32), int32] */;
  %74 = qnn.requantize(%73, meta[relay.Constant][88] /* ty=Tensor[(56), float32] */, meta[relay.Constant][89] /* ty=Tensor[(56), int32] */, 0.0268897f /* ty=float32 */, -9 /* ty=int32 */, axis=1, out_dtype="int8") /* ty=Tensor[(1, 56, 32, 32), int8] */;
  %75 = qnn.conv2d(%74, meta[relay.Constant][90] /* ty=Tensor[(336, 56, 1, 1), int8] */, -9 /* ty=int32 */, meta[relay.Constant][91] /* ty=Tensor[(336), int32] */, 0.0268897f /* ty=float32 */, meta[relay.Constant][92] /* ty=Tensor[(336), float32] */, padding=[0, 0, 0, 0], channels=336, kernel_size=[1, 1], out_dtype="int32") /* ty=Tensor[(1, 336, 32, 32), int32] */;
  %76 = nn.bias_add(%75, meta[relay.Constant][93] /* ty=Tensor[(336), int32] */) /* ty=Tensor[(1, 336, 32, 32), int32] */;
  %77 = qnn.quantize(meta[relay.Constant][94] /* ty=Tensor[(1, 336, 1, 1), float32] */, meta[relay.Constant][95] /* ty=Tensor[(336), float32] */, meta[relay.Constant][96] /* ty=Tensor[(336), int32] */, out_dtype="int32", axis=1) /* ty=Tensor[(1, 336, 1, 1), int32] */;
  %78 = maximum(%76, %77) /* ty=Tensor[(1, 336, 32, 32), int32] */;
  %79 = qnn.quantize(meta[relay.Constant][97] /* ty=Tensor[(1, 336, 1, 1), float32] */, meta[relay.Constant][95] /* ty=Tensor[(336), float32] */, meta[relay.Constant][96] /* ty=Tensor[(336), int32] */, out_dtype="int32", axis=1) /* ty=Tensor[(1, 336, 1, 1), int32] */;
  %80 = minimum(%78, %79) /* ty=Tensor[(1, 336, 32, 32), int32] */;
  %81 = qnn.requantize(%80, meta[relay.Constant][95] /* ty=Tensor[(336), float32] */, meta[relay.Constant][96] /* ty=Tensor[(336), int32] */, 0.0235294f /* ty=float32 */, -128 /* ty=int32 */, axis=1, out_dtype="int8") /* ty=Tensor[(1, 336, 32, 32), int8] */;
  %82 = qnn.conv2d(%81, meta[relay.Constant][98] /* ty=Tensor[(336, 1, 3, 3), int8] */, -128 /* ty=int32 */, meta[relay.Constant][99] /* ty=Tensor[(336), int32] */, 0.0235294f /* ty=float32 */, meta[relay.Constant][100] /* ty=Tensor[(336), float32] */, padding=[1, 1, 1, 1], groups=336, channels=336, kernel_size=[3, 3], out_dtype="int32") /* ty=Tensor[(1, 336, 32, 32), int32] */;
  %83 = nn.bias_add(%82, meta[relay.Constant][101] /* ty=Tensor[(336), int32] */) /* ty=Tensor[(1, 336, 32, 32), int32] */;
  %84 = qnn.quantize(meta[relay.Constant][102] /* ty=Tensor[(1, 336, 1, 1), float32] */, meta[relay.Constant][103] /* ty=Tensor[(336), float32] */, meta[relay.Constant][104] /* ty=Tensor[(336), int32] */, out_dtype="int32", axis=1) /* ty=Tensor[(1, 336, 1, 1), int32] */;
  %85 = maximum(%83, %84) /* ty=Tensor[(1, 336, 32, 32), int32] */;
  %86 = qnn.quantize(meta[relay.Constant][105] /* ty=Tensor[(1, 336, 1, 1), float32] */, meta[relay.Constant][103] /* ty=Tensor[(336), float32] */, meta[relay.Constant][104] /* ty=Tensor[(336), int32] */, out_dtype="int32", axis=1) /* ty=Tensor[(1, 336, 1, 1), int32] */;
  %87 = minimum(%85, %86) /* ty=Tensor[(1, 336, 32, 32), int32] */;
  %88 = qnn.requantize(%87, meta[relay.Constant][103] /* ty=Tensor[(336), float32] */, meta[relay.Constant][104] /* ty=Tensor[(336), int32] */, 0.0235294f /* ty=float32 */, -128 /* ty=int32 */, axis=1, out_dtype="int8") /* ty=Tensor[(1, 336, 32, 32), int8] */;
  %89 = qnn.conv2d(%88, meta[relay.Constant][106] /* ty=Tensor[(56, 336, 1, 1), int8] */, -128 /* ty=int32 */, meta[relay.Constant][107] /* ty=Tensor[(56), int32] */, 0.0235294f /* ty=float32 */, meta[relay.Constant][108] /* ty=Tensor[(56), float32] */, padding=[0, 0, 0, 0], channels=56, kernel_size=[1, 1], out_dtype="int32") /* ty=Tensor[(1, 56, 32, 32), int32] */;
  %90 = nn.bias_add(%89, meta[relay.Constant][109] /* ty=Tensor[(56), int32] */) /* ty=Tensor[(1, 56, 32, 32), int32] */;
  %91 = qnn.requantize(%90, meta[relay.Constant][110] /* ty=Tensor[(56), float32] */, meta[relay.Constant][111] /* ty=Tensor[(56), int32] */, 0.0256578f /* ty=float32 */, 4 /* ty=int32 */, axis=1, out_dtype="int8") /* ty=Tensor[(1, 56, 32, 32), int8] */;
  %92 = qnn.add(%74, %91, 0.0268897f /* ty=float32 */, -9 /* ty=int32 */, 0.0256578f /* ty=float32 */, 4 /* ty=int32 */, 0.0466993f /* ty=float32 */, -2 /* ty=int32 */) /* ty=Tensor[(1, 56, 32, 32), int8] */;
  %93 = qnn.conv2d(%92, meta[relay.Constant][112] /* ty=Tensor[(336, 56, 1, 1), int8] */, -2 /* ty=int32 */, meta[relay.Constant][113] /* ty=Tensor[(336), int32] */, 0.0466993f /* ty=float32 */, meta[relay.Constant][114] /* ty=Tensor[(336), float32] */, padding=[0, 0, 0, 0], channels=336, kernel_size=[1, 1], out_dtype="int32") /* ty=Tensor[(1, 336, 32, 32), int32] */;
  %94 = nn.bias_add(%93, meta[relay.Constant][115] /* ty=Tensor[(336), int32] */) /* ty=Tensor[(1, 336, 32, 32), int32] */;
  %95 = qnn.quantize(meta[relay.Constant][116] /* ty=Tensor[(1, 336, 1, 1), float32] */, meta[relay.Constant][117] /* ty=Tensor[(336), float32] */, meta[relay.Constant][118] /* ty=Tensor[(336), int32] */, out_dtype="int32", axis=1) /* ty=Tensor[(1, 336, 1, 1), int32] */;
  %96 = maximum(%94, %95) /* ty=Tensor[(1, 336, 32, 32), int32] */;
  %97 = qnn.quantize(meta[relay.Constant][119] /* ty=Tensor[(1, 336, 1, 1), float32] */, meta[relay.Constant][117] /* ty=Tensor[(336), float32] */, meta[relay.Constant][118] /* ty=Tensor[(336), int32] */, out_dtype="int32", axis=1) /* ty=Tensor[(1, 336, 1, 1), int32] */;
  %98 = minimum(%96, %97) /* ty=Tensor[(1, 336, 32, 32), int32] */;
  %99 = qnn.requantize(%98, meta[relay.Constant][117] /* ty=Tensor[(336), float32] */, meta[relay.Constant][118] /* ty=Tensor[(336), int32] */, 0.0235294f /* ty=float32 */, -128 /* ty=int32 */, axis=1, out_dtype="int8") /* ty=Tensor[(1, 336, 32, 32), int8] */;
  %100 = qnn.conv2d(%99, meta[relay.Constant][120] /* ty=Tensor[(336, 1, 3, 3), int8] */, -128 /* ty=int32 */, meta[relay.Constant][121] /* ty=Tensor[(336), int32] */, 0.0235294f /* ty=float32 */, meta[relay.Constant][122] /* ty=Tensor[(336), float32] */, padding=[1, 1, 1, 1], groups=336, channels=336, kernel_size=[3, 3], out_dtype="int32") /* ty=Tensor[(1, 336, 32, 32), int32] */;
  %101 = nn.bias_add(%100, meta[relay.Constant][123] /* ty=Tensor[(336), int32] */) /* ty=Tensor[(1, 336, 32, 32), int32] */;
  %102 = qnn.quantize(meta[relay.Constant][124] /* ty=Tensor[(1, 336, 1, 1), float32] */, meta[relay.Constant][125] /* ty=Tensor[(336), float32] */, meta[relay.Constant][126] /* ty=Tensor[(336), int32] */, out_dtype="int32", axis=1) /* ty=Tensor[(1, 336, 1, 1), int32] */;
  %103 = maximum(%101, %102) /* ty=Tensor[(1, 336, 32, 32), int32] */;
  %104 = qnn.quantize(meta[relay.Constant][127] /* ty=Tensor[(1, 336, 1, 1), float32] */, meta[relay.Constant][125] /* ty=Tensor[(336), float32] */, meta[relay.Constant][126] /* ty=Tensor[(336), int32] */, out_dtype="int32", axis=1) /* ty=Tensor[(1, 336, 1, 1), int32] */;
  %105 = minimum(%103, %104) /* ty=Tensor[(1, 336, 32, 32), int32] */;
  %106 = qnn.requantize(%105, meta[relay.Constant][125] /* ty=Tensor[(336), float32] */, meta[relay.Constant][126] /* ty=Tensor[(336), int32] */, 0.0235294f /* ty=float32 */, -128 /* ty=int32 */, axis=1, out_dtype="int8") /* ty=Tensor[(1, 336, 32, 32), int8] */;
  %107 = qnn.conv2d(%106, meta[relay.Constant][128] /* ty=Tensor[(56, 336, 1, 1), int8] */, -128 /* ty=int32 */, meta[relay.Constant][129] /* ty=Tensor[(56), int32] */, 0.0235294f /* ty=float32 */, meta[relay.Constant][130] /* ty=Tensor[(56), float32] */, padding=[0, 0, 0, 0], channels=56, kernel_size=[1, 1], out_dtype="int32") /* ty=Tensor[(1, 56, 32, 32), int32] */;
  %108 = nn.bias_add(%107, meta[relay.Constant][131] /* ty=Tensor[(56), int32] */) /* ty=Tensor[(1, 56, 32, 32), int32] */;
  %109 = qnn.requantize(%108, meta[relay.Constant][132] /* ty=Tensor[(56), float32] */, meta[relay.Constant][133] /* ty=Tensor[(56), int32] */, 0.0470043f /* ty=float32 */, -8 /* ty=int32 */, axis=1, out_dtype="int8") /* ty=Tensor[(1, 56, 32, 32), int8] */;
  %110 = qnn.add(%92, %109, 0.0466993f /* ty=float32 */, -2 /* ty=int32 */, 0.0470043f /* ty=float32 */, -8 /* ty=int32 */, 0.0647469f /* ty=float32 */, 0 /* ty=int32 */) /* ty=Tensor[(1, 56, 32, 32), int8] */;
  %111 = qnn.conv2d(%110, meta[relay.Constant][134] /* ty=Tensor[(336, 56, 1, 1), int8] */, 0 /* ty=int32 */, meta[relay.Constant][135] /* ty=Tensor[(336), int32] */, 0.0647469f /* ty=float32 */, meta[relay.Constant][136] /* ty=Tensor[(336), float32] */, padding=[0, 0, 0, 0], channels=336, kernel_size=[1, 1], out_dtype="int32") /* ty=Tensor[(1, 336, 32, 32), int32] */;
  %112 = nn.bias_add(%111, meta[relay.Constant][137] /* ty=Tensor[(336), int32] */) /* ty=Tensor[(1, 336, 32, 32), int32] */;
  %113 = qnn.quantize(meta[relay.Constant][138] /* ty=Tensor[(1, 336, 1, 1), float32] */, meta[relay.Constant][139] /* ty=Tensor[(336), float32] */, meta[relay.Constant][140] /* ty=Tensor[(336), int32] */, out_dtype="int32", axis=1) /* ty=Tensor[(1, 336, 1, 1), int32] */;
  %114 = maximum(%112, %113) /* ty=Tensor[(1, 336, 32, 32), int32] */;
  %115 = qnn.quantize(meta[relay.Constant][141] /* ty=Tensor[(1, 336, 1, 1), float32] */, meta[relay.Constant][139] /* ty=Tensor[(336), float32] */, meta[relay.Constant][140] /* ty=Tensor[(336), int32] */, out_dtype="int32", axis=1) /* ty=Tensor[(1, 336, 1, 1), int32] */;
  %116 = minimum(%114, %115) /* ty=Tensor[(1, 336, 32, 32), int32] */;
  %117 = qnn.requantize(%116, meta[relay.Constant][139] /* ty=Tensor[(336), float32] */, meta[relay.Constant][140] /* ty=Tensor[(336), int32] */, 0.0235294f /* ty=float32 */, -128 /* ty=int32 */, axis=1, out_dtype="int8") /* ty=Tensor[(1, 336, 32, 32), int8] */;
  %118 = qnn.conv2d(%117, meta[relay.Constant][142] /* ty=Tensor[(336, 1, 3, 3), int8] */, -128 /* ty=int32 */, meta[relay.Constant][143] /* ty=Tensor[(336), int32] */, 0.0235294f /* ty=float32 */, meta[relay.Constant][144] /* ty=Tensor[(336), float32] */, strides=[2, 2], padding=[0, 0, 1, 1], groups=336, channels=336, kernel_size=[3, 3], out_dtype="int32") /* ty=Tensor[(1, 336, 16, 16), int32] */;
  %119 = nn.bias_add(%118, meta[relay.Constant][145] /* ty=Tensor[(336), int32] */) /* ty=Tensor[(1, 336, 16, 16), int32] */;
  %120 = qnn.quantize(meta[relay.Constant][146] /* ty=Tensor[(1, 336, 1, 1), float32] */, meta[relay.Constant][147] /* ty=Tensor[(336), float32] */, meta[relay.Constant][148] /* ty=Tensor[(336), int32] */, out_dtype="int32", axis=1) /* ty=Tensor[(1, 336, 1, 1), int32] */;
  %121 = maximum(%119, %120) /* ty=Tensor[(1, 336, 16, 16), int32] */;
  %122 = qnn.quantize(meta[relay.Constant][149] /* ty=Tensor[(1, 336, 1, 1), float32] */, meta[relay.Constant][147] /* ty=Tensor[(336), float32] */, meta[relay.Constant][148] /* ty=Tensor[(336), int32] */, out_dtype="int32", axis=1) /* ty=Tensor[(1, 336, 1, 1), int32] */;
  %123 = minimum(%121, %122) /* ty=Tensor[(1, 336, 16, 16), int32] */;
  %124 = qnn.requantize(%123, meta[relay.Constant][147] /* ty=Tensor[(336), float32] */, meta[relay.Constant][148] /* ty=Tensor[(336), int32] */, 0.0235294f /* ty=float32 */, -128 /* ty=int32 */, axis=1, out_dtype="int8") /* ty=Tensor[(1, 336, 16, 16), int8] */;
  %125 = qnn.conv2d(%124, meta[relay.Constant][150] /* ty=Tensor[(112, 336, 1, 1), int8] */, -128 /* ty=int32 */, meta[relay.Constant][151] /* ty=Tensor[(112), int32] */, 0.0235294f /* ty=float32 */, meta[relay.Constant][152] /* ty=Tensor[(112), float32] */, padding=[0, 0, 0, 0], channels=112, kernel_size=[1, 1], out_dtype="int32") /* ty=Tensor[(1, 112, 16, 16), int32] */;
  %126 = nn.bias_add(%125, meta[relay.Constant][153] /* ty=Tensor[(112), int32] */) /* ty=Tensor[(1, 112, 16, 16), int32] */;
  %127 = qnn.requantize(%126, meta[relay.Constant][154] /* ty=Tensor[(112), float32] */, meta[relay.Constant][155] /* ty=Tensor[(112), int32] */, 0.0806844f /* ty=float32 */, -18 /* ty=int32 */, axis=1, out_dtype="int8") /* ty=Tensor[(1, 112, 16, 16), int8] */;
  %128 = qnn.conv2d(%127, meta[relay.Constant][156] /* ty=Tensor[(672, 112, 1, 1), int8] */, -18 /* ty=int32 */, meta[relay.Constant][157] /* ty=Tensor[(672), int32] */, 0.0806844f /* ty=float32 */, meta[relay.Constant][158] /* ty=Tensor[(672), float32] */, padding=[0, 0, 0, 0], channels=672, kernel_size=[1, 1], out_dtype="int32") /* ty=Tensor[(1, 672, 16, 16), int32] */;
  %129 = nn.bias_add(%128, meta[relay.Constant][159] /* ty=Tensor[(672), int32] */) /* ty=Tensor[(1, 672, 16, 16), int32] */;
  %130 = qnn.quantize(meta[relay.Constant][160] /* ty=Tensor[(1, 672, 1, 1), float32] */, meta[relay.Constant][161] /* ty=Tensor[(672), float32] */, meta[relay.Constant][162] /* ty=Tensor[(672), int32] */, out_dtype="int32", axis=1) /* ty=Tensor[(1, 672, 1, 1), int32] */;
  %131 = maximum(%129, %130) /* ty=Tensor[(1, 672, 16, 16), int32] */;
  %132 = qnn.quantize(meta[relay.Constant][163] /* ty=Tensor[(1, 672, 1, 1), float32] */, meta[relay.Constant][161] /* ty=Tensor[(672), float32] */, meta[relay.Constant][162] /* ty=Tensor[(672), int32] */, out_dtype="int32", axis=1) /* ty=Tensor[(1, 672, 1, 1), int32] */;
  %133 = minimum(%131, %132) /* ty=Tensor[(1, 672, 16, 16), int32] */;
  %134 = qnn.requantize(%133, meta[relay.Constant][161] /* ty=Tensor[(672), float32] */, meta[relay.Constant][162] /* ty=Tensor[(672), int32] */, 0.0235294f /* ty=float32 */, -128 /* ty=int32 */, axis=1, out_dtype="int8") /* ty=Tensor[(1, 672, 16, 16), int8] */;
  %135 = qnn.conv2d(%134, meta[relay.Constant][164] /* ty=Tensor[(672, 1, 3, 3), int8] */, -128 /* ty=int32 */, meta[relay.Constant][165] /* ty=Tensor[(672), int32] */, 0.0235294f /* ty=float32 */, meta[relay.Constant][166] /* ty=Tensor[(672), float32] */, padding=[1, 1, 1, 1], groups=672, channels=672, kernel_size=[3, 3], out_dtype="int32") /* ty=Tensor[(1, 672, 16, 16), int32] */;
  %136 = nn.bias_add(%135, meta[relay.Constant][167] /* ty=Tensor[(672), int32] */) /* ty=Tensor[(1, 672, 16, 16), int32] */;
  %137 = qnn.quantize(meta[relay.Constant][168] /* ty=Tensor[(1, 672, 1, 1), float32] */, meta[relay.Constant][169] /* ty=Tensor[(672), float32] */, meta[relay.Constant][170] /* ty=Tensor[(672), int32] */, out_dtype="int32", axis=1) /* ty=Tensor[(1, 672, 1, 1), int32] */;
  %138 = maximum(%136, %137) /* ty=Tensor[(1, 672, 16, 16), int32] */;
  %139 = qnn.quantize(meta[relay.Constant][171] /* ty=Tensor[(1, 672, 1, 1), float32] */, meta[relay.Constant][169] /* ty=Tensor[(672), float32] */, meta[relay.Constant][170] /* ty=Tensor[(672), int32] */, out_dtype="int32", axis=1) /* ty=Tensor[(1, 672, 1, 1), int32] */;
  %140 = minimum(%138, %139) /* ty=Tensor[(1, 672, 16, 16), int32] */;
  %141 = qnn.requantize(%140, meta[relay.Constant][169] /* ty=Tensor[(672), float32] */, meta[relay.Constant][170] /* ty=Tensor[(672), int32] */, 0.0235294f /* ty=float32 */, -128 /* ty=int32 */, axis=1, out_dtype="int8") /* ty=Tensor[(1, 672, 16, 16), int8] */;
  %142 = qnn.conv2d(%141, meta[relay.Constant][172] /* ty=Tensor[(112, 672, 1, 1), int8] */, -128 /* ty=int32 */, meta[relay.Constant][173] /* ty=Tensor[(112), int32] */, 0.0235294f /* ty=float32 */, meta[relay.Constant][174] /* ty=Tensor[(112), float32] */, padding=[0, 0, 0, 0], channels=112, kernel_size=[1, 1], out_dtype="int32") /* ty=Tensor[(1, 112, 16, 16), int32] */;
  %143 = nn.bias_add(%142, meta[relay.Constant][175] /* ty=Tensor[(112), int32] */) /* ty=Tensor[(1, 112, 16, 16), int32] */;
  %144 = qnn.requantize(%143, meta[relay.Constant][176] /* ty=Tensor[(112), float32] */, meta[relay.Constant][177] /* ty=Tensor[(112), int32] */, 0.0557437f /* ty=float32 */, 9 /* ty=int32 */, axis=1, out_dtype="int8") /* ty=Tensor[(1, 112, 16, 16), int8] */;
  %145 = qnn.add(%127, %144, 0.0806844f /* ty=float32 */, -18 /* ty=int32 */, 0.0557437f /* ty=float32 */, 9 /* ty=int32 */, 0.0995401f /* ty=float32 */, -13 /* ty=int32 */) /* ty=Tensor[(1, 112, 16, 16), int8] */;
  %146 = qnn.conv2d(%145, meta[relay.Constant][178] /* ty=Tensor[(672, 112, 1, 1), int8] */, -13 /* ty=int32 */, meta[relay.Constant][179] /* ty=Tensor[(672), int32] */, 0.0995401f /* ty=float32 */, meta[relay.Constant][180] /* ty=Tensor[(672), float32] */, padding=[0, 0, 0, 0], channels=672, kernel_size=[1, 1], out_dtype="int32") /* ty=Tensor[(1, 672, 16, 16), int32] */;
  %147 = nn.bias_add(%146, meta[relay.Constant][181] /* ty=Tensor[(672), int32] */) /* ty=Tensor[(1, 672, 16, 16), int32] */;
  %148 = qnn.quantize(meta[relay.Constant][182] /* ty=Tensor[(1, 672, 1, 1), float32] */, meta[relay.Constant][183] /* ty=Tensor[(672), float32] */, meta[relay.Constant][184] /* ty=Tensor[(672), int32] */, out_dtype="int32", axis=1) /* ty=Tensor[(1, 672, 1, 1), int32] */;
  %149 = maximum(%147, %148) /* ty=Tensor[(1, 672, 16, 16), int32] */;
  %150 = qnn.quantize(meta[relay.Constant][185] /* ty=Tensor[(1, 672, 1, 1), float32] */, meta[relay.Constant][183] /* ty=Tensor[(672), float32] */, meta[relay.Constant][184] /* ty=Tensor[(672), int32] */, out_dtype="int32", axis=1) /* ty=Tensor[(1, 672, 1, 1), int32] */;
  %151 = minimum(%149, %150) /* ty=Tensor[(1, 672, 16, 16), int32] */;
  %152 = qnn.requantize(%151, meta[relay.Constant][183] /* ty=Tensor[(672), float32] */, meta[relay.Constant][184] /* ty=Tensor[(672), int32] */, 0.0235294f /* ty=float32 */, -128 /* ty=int32 */, axis=1, out_dtype="int8") /* ty=Tensor[(1, 672, 16, 16), int8] */;
  %153 = qnn.conv2d(%152, meta[relay.Constant][186] /* ty=Tensor[(672, 1, 3, 3), int8] */, -128 /* ty=int32 */, meta[relay.Constant][187] /* ty=Tensor[(672), int32] */, 0.0235294f /* ty=float32 */, meta[relay.Constant][188] /* ty=Tensor[(672), float32] */, padding=[1, 1, 1, 1], groups=672, channels=672, kernel_size=[3, 3], out_dtype="int32") /* ty=Tensor[(1, 672, 16, 16), int32] */;
  %154 = nn.bias_add(%153, meta[relay.Constant][189] /* ty=Tensor[(672), int32] */) /* ty=Tensor[(1, 672, 16, 16), int32] */;
  %155 = qnn.quantize(meta[relay.Constant][190] /* ty=Tensor[(1, 672, 1, 1), float32] */, meta[relay.Constant][191] /* ty=Tensor[(672), float32] */, meta[relay.Constant][192] /* ty=Tensor[(672), int32] */, out_dtype="int32", axis=1) /* ty=Tensor[(1, 672, 1, 1), int32] */;
  %156 = maximum(%154, %155) /* ty=Tensor[(1, 672, 16, 16), int32] */;
  %157 = qnn.quantize(meta[relay.Constant][193] /* ty=Tensor[(1, 672, 1, 1), float32] */, meta[relay.Constant][191] /* ty=Tensor[(672), float32] */, meta[relay.Constant][192] /* ty=Tensor[(672), int32] */, out_dtype="int32", axis=1) /* ty=Tensor[(1, 672, 1, 1), int32] */;
  %158 = minimum(%156, %157) /* ty=Tensor[(1, 672, 16, 16), int32] */;
  %159 = qnn.requantize(%158, meta[relay.Constant][191] /* ty=Tensor[(672), float32] */, meta[relay.Constant][192] /* ty=Tensor[(672), int32] */, 0.0235294f /* ty=float32 */, -128 /* ty=int32 */, axis=1, out_dtype="int8") /* ty=Tensor[(1, 672, 16, 16), int8] */;
  %160 = qnn.conv2d(%159, meta[relay.Constant][194] /* ty=Tensor[(112, 672, 1, 1), int8] */, -128 /* ty=int32 */, meta[relay.Constant][195] /* ty=Tensor[(112), int32] */, 0.0235294f /* ty=float32 */, meta[relay.Constant][196] /* ty=Tensor[(112), float32] */, padding=[0, 0, 0, 0], channels=112, kernel_size=[1, 1], out_dtype="int32") /* ty=Tensor[(1, 112, 16, 16), int32] */;
  %161 = nn.bias_add(%160, meta[relay.Constant][197] /* ty=Tensor[(112), int32] */) /* ty=Tensor[(1, 112, 16, 16), int32] */;
  %162 = qnn.requantize(%161, meta[relay.Constant][198] /* ty=Tensor[(112), float32] */, meta[relay.Constant][199] /* ty=Tensor[(112), int32] */, 0.0690793f /* ty=float32 */, 6 /* ty=int32 */, axis=1, out_dtype="int8") /* ty=Tensor[(1, 112, 16, 16), int8] */;
  %163 = qnn.add(%145, %162, 0.0995401f /* ty=float32 */, -13 /* ty=int32 */, 0.0690793f /* ty=float32 */, 6 /* ty=int32 */, 0.111631f /* ty=float32 */, -1 /* ty=int32 */) /* ty=Tensor[(1, 112, 16, 16), int8] */;
  %164 = qnn.conv2d(%163, meta[relay.Constant][200] /* ty=Tensor[(672, 112, 1, 1), int8] */, -1 /* ty=int32 */, meta[relay.Constant][201] /* ty=Tensor[(672), int32] */, 0.111631f /* ty=float32 */, meta[relay.Constant][202] /* ty=Tensor[(672), float32] */, padding=[0, 0, 0, 0], channels=672, kernel_size=[1, 1], out_dtype="int32") /* ty=Tensor[(1, 672, 16, 16), int32] */;
  %165 = nn.bias_add(%164, meta[relay.Constant][203] /* ty=Tensor[(672), int32] */) /* ty=Tensor[(1, 672, 16, 16), int32] */;
  %166 = qnn.quantize(meta[relay.Constant][204] /* ty=Tensor[(1, 672, 1, 1), float32] */, meta[relay.Constant][205] /* ty=Tensor[(672), float32] */, meta[relay.Constant][206] /* ty=Tensor[(672), int32] */, out_dtype="int32", axis=1) /* ty=Tensor[(1, 672, 1, 1), int32] */;
  %167 = maximum(%165, %166) /* ty=Tensor[(1, 672, 16, 16), int32] */;
  %168 = qnn.quantize(meta[relay.Constant][207] /* ty=Tensor[(1, 672, 1, 1), float32] */, meta[relay.Constant][205] /* ty=Tensor[(672), float32] */, meta[relay.Constant][206] /* ty=Tensor[(672), int32] */, out_dtype="int32", axis=1) /* ty=Tensor[(1, 672, 1, 1), int32] */;
  %169 = minimum(%167, %168) /* ty=Tensor[(1, 672, 16, 16), int32] */;
  %170 = qnn.requantize(%169, meta[relay.Constant][205] /* ty=Tensor[(672), float32] */, meta[relay.Constant][206] /* ty=Tensor[(672), int32] */, 0.0235294f /* ty=float32 */, -128 /* ty=int32 */, axis=1, out_dtype="int8") /* ty=Tensor[(1, 672, 16, 16), int8] */;
  %171 = qnn.conv2d(%170, meta[relay.Constant][208] /* ty=Tensor[(672, 1, 3, 3), int8] */, -128 /* ty=int32 */, meta[relay.Constant][209] /* ty=Tensor[(672), int32] */, 0.0235294f /* ty=float32 */, meta[relay.Constant][210] /* ty=Tensor[(672), float32] */, padding=[1, 1, 1, 1], groups=672, channels=672, kernel_size=[3, 3], out_dtype="int32") /* ty=Tensor[(1, 672, 16, 16), int32] */;
  %172 = nn.bias_add(%171, meta[relay.Constant][211] /* ty=Tensor[(672), int32] */) /* ty=Tensor[(1, 672, 16, 16), int32] */;
  %173 = qnn.quantize(meta[relay.Constant][212] /* ty=Tensor[(1, 672, 1, 1), float32] */, meta[relay.Constant][213] /* ty=Tensor[(672), float32] */, meta[relay.Constant][214] /* ty=Tensor[(672), int32] */, out_dtype="int32", axis=1) /* ty=Tensor[(1, 672, 1, 1), int32] */;
  %174 = maximum(%172, %173) /* ty=Tensor[(1, 672, 16, 16), int32] */;
  %175 = qnn.quantize(meta[relay.Constant][215] /* ty=Tensor[(1, 672, 1, 1), float32] */, meta[relay.Constant][213] /* ty=Tensor[(672), float32] */, meta[relay.Constant][214] /* ty=Tensor[(672), int32] */, out_dtype="int32", axis=1) /* ty=Tensor[(1, 672, 1, 1), int32] */;
  %176 = minimum(%174, %175) /* ty=Tensor[(1, 672, 16, 16), int32] */;
  %177 = qnn.requantize(%176, meta[relay.Constant][213] /* ty=Tensor[(672), float32] */, meta[relay.Constant][214] /* ty=Tensor[(672), int32] */, 0.0235294f /* ty=float32 */, -128 /* ty=int32 */, axis=1, out_dtype="int8") /* ty=Tensor[(1, 672, 16, 16), int8] */;
  %178 = qnn.conv2d(%177, meta[relay.Constant][216] /* ty=Tensor[(112, 672, 1, 1), int8] */, -128 /* ty=int32 */, meta[relay.Constant][217] /* ty=Tensor[(112), int32] */, 0.0235294f /* ty=float32 */, meta[relay.Constant][218] /* ty=Tensor[(112), float32] */, padding=[0, 0, 0, 0], channels=112, kernel_size=[1, 1], out_dtype="int32") /* ty=Tensor[(1, 112, 16, 16), int32] */;
  %179 = nn.bias_add(%178, meta[relay.Constant][219] /* ty=Tensor[(112), int32] */) /* ty=Tensor[(1, 112, 16, 16), int32] */;
  %180 = qnn.requantize(%179, meta[relay.Constant][220] /* ty=Tensor[(112), float32] */, meta[relay.Constant][221] /* ty=Tensor[(112), int32] */, 0.107376f /* ty=float32 */, 4 /* ty=int32 */, axis=1, out_dtype="int8") /* ty=Tensor[(1, 112, 16, 16), int8] */;
  %181 = qnn.add(%163, %180, 0.111631f /* ty=float32 */, -1 /* ty=int32 */, 0.107376f /* ty=float32 */, 4 /* ty=int32 */, 0.17098f /* ty=float32 */, 2 /* ty=int32 */) /* ty=Tensor[(1, 112, 16, 16), int8] */;
  %182 = qnn.conv2d(%181, meta[relay.Constant][222] /* ty=Tensor[(672, 112, 1, 1), int8] */, 2 /* ty=int32 */, meta[relay.Constant][223] /* ty=Tensor[(672), int32] */, 0.17098f /* ty=float32 */, meta[relay.Constant][224] /* ty=Tensor[(672), float32] */, padding=[0, 0, 0, 0], channels=672, kernel_size=[1, 1], out_dtype="int32") /* ty=Tensor[(1, 672, 16, 16), int32] */;
  %183 = nn.bias_add(%182, meta[relay.Constant][225] /* ty=Tensor[(672), int32] */) /* ty=Tensor[(1, 672, 16, 16), int32] */;
  %184 = qnn.quantize(meta[relay.Constant][226] /* ty=Tensor[(1, 672, 1, 1), float32] */, meta[relay.Constant][227] /* ty=Tensor[(672), float32] */, meta[relay.Constant][228] /* ty=Tensor[(672), int32] */, out_dtype="int32", axis=1) /* ty=Tensor[(1, 672, 1, 1), int32] */;
  %185 = maximum(%183, %184) /* ty=Tensor[(1, 672, 16, 16), int32] */;
  %186 = qnn.quantize(meta[relay.Constant][229] /* ty=Tensor[(1, 672, 1, 1), float32] */, meta[relay.Constant][227] /* ty=Tensor[(672), float32] */, meta[relay.Constant][228] /* ty=Tensor[(672), int32] */, out_dtype="int32", axis=1) /* ty=Tensor[(1, 672, 1, 1), int32] */;
  %187 = minimum(%185, %186) /* ty=Tensor[(1, 672, 16, 16), int32] */;
  %188 = qnn.requantize(%187, meta[relay.Constant][227] /* ty=Tensor[(672), float32] */, meta[relay.Constant][228] /* ty=Tensor[(672), int32] */, 0.0235294f /* ty=float32 */, -128 /* ty=int32 */, axis=1, out_dtype="int8") /* ty=Tensor[(1, 672, 16, 16), int8] */;
  %189 = qnn.conv2d(%188, meta[relay.Constant][230] /* ty=Tensor[(672, 1, 3, 3), int8] */, -128 /* ty=int32 */, meta[relay.Constant][231] /* ty=Tensor[(672), int32] */, 0.0235294f /* ty=float32 */, meta[relay.Constant][232] /* ty=Tensor[(672), float32] */, padding=[1, 1, 1, 1], groups=672, channels=672, kernel_size=[3, 3], out_dtype="int32") /* ty=Tensor[(1, 672, 16, 16), int32] */;
  %190 = nn.bias_add(%189, meta[relay.Constant][233] /* ty=Tensor[(672), int32] */) /* ty=Tensor[(1, 672, 16, 16), int32] */;
  %191 = qnn.quantize(meta[relay.Constant][234] /* ty=Tensor[(1, 672, 1, 1), float32] */, meta[relay.Constant][235] /* ty=Tensor[(672), float32] */, meta[relay.Constant][236] /* ty=Tensor[(672), int32] */, out_dtype="int32", axis=1) /* ty=Tensor[(1, 672, 1, 1), int32] */;
  %192 = maximum(%190, %191) /* ty=Tensor[(1, 672, 16, 16), int32] */;
  %193 = qnn.quantize(meta[relay.Constant][237] /* ty=Tensor[(1, 672, 1, 1), float32] */, meta[relay.Constant][235] /* ty=Tensor[(672), float32] */, meta[relay.Constant][236] /* ty=Tensor[(672), int32] */, out_dtype="int32", axis=1) /* ty=Tensor[(1, 672, 1, 1), int32] */;
  %194 = minimum(%192, %193) /* ty=Tensor[(1, 672, 16, 16), int32] */;
  %195 = qnn.requantize(%194, meta[relay.Constant][235] /* ty=Tensor[(672), float32] */, meta[relay.Constant][236] /* ty=Tensor[(672), int32] */, 0.0235294f /* ty=float32 */, -128 /* ty=int32 */, axis=1, out_dtype="int8") /* ty=Tensor[(1, 672, 16, 16), int8] */;
  %196 = qnn.conv2d(%195, meta[relay.Constant][238] /* ty=Tensor[(168, 672, 1, 1), int8] */, -128 /* ty=int32 */, meta[relay.Constant][239] /* ty=Tensor[(168), int32] */, 0.0235294f /* ty=float32 */, meta[relay.Constant][240] /* ty=Tensor[(168), float32] */, padding=[0, 0, 0, 0], channels=168, kernel_size=[1, 1], out_dtype="int32") /* ty=Tensor[(1, 168, 16, 16), int32] */;
  %197 = nn.bias_add(%196, meta[relay.Constant][241] /* ty=Tensor[(168), int32] */) /* ty=Tensor[(1, 168, 16, 16), int32] */;
  %198 = qnn.requantize(%197, meta[relay.Constant][242] /* ty=Tensor[(168), float32] */, meta[relay.Constant][243] /* ty=Tensor[(168), int32] */, 0.160035f /* ty=float32 */, 13 /* ty=int32 */, axis=1, out_dtype="int8") /* ty=Tensor[(1, 168, 16, 16), int8] */;
  %199 = qnn.conv2d(%198, meta[relay.Constant][244] /* ty=Tensor[(1008, 168, 1, 1), int8] */, 13 /* ty=int32 */, meta[relay.Constant][245] /* ty=Tensor[(1008), int32] */, 0.160035f /* ty=float32 */, meta[relay.Constant][246] /* ty=Tensor[(1008), float32] */, padding=[0, 0, 0, 0], channels=1008, kernel_size=[1, 1], out_dtype="int32") /* ty=Tensor[(1, 1008, 16, 16), int32] */;
  %200 = nn.bias_add(%199, meta[relay.Constant][247] /* ty=Tensor[(1008), int32] */) /* ty=Tensor[(1, 1008, 16, 16), int32] */;
  %201 = qnn.quantize(meta[relay.Constant][248] /* ty=Tensor[(1, 1008, 1, 1), float32] */, meta[relay.Constant][249] /* ty=Tensor[(1008), float32] */, meta[relay.Constant][250] /* ty=Tensor[(1008), int32] */, out_dtype="int32", axis=1) /* ty=Tensor[(1, 1008, 1, 1), int32] */;
  %202 = maximum(%200, %201) /* ty=Tensor[(1, 1008, 16, 16), int32] */;
  %203 = qnn.quantize(meta[relay.Constant][251] /* ty=Tensor[(1, 1008, 1, 1), float32] */, meta[relay.Constant][249] /* ty=Tensor[(1008), float32] */, meta[relay.Constant][250] /* ty=Tensor[(1008), int32] */, out_dtype="int32", axis=1) /* ty=Tensor[(1, 1008, 1, 1), int32] */;
  %204 = minimum(%202, %203) /* ty=Tensor[(1, 1008, 16, 16), int32] */;
  %205 = qnn.requantize(%204, meta[relay.Constant][249] /* ty=Tensor[(1008), float32] */, meta[relay.Constant][250] /* ty=Tensor[(1008), int32] */, 0.0235294f /* ty=float32 */, -128 /* ty=int32 */, axis=1, out_dtype="int8") /* ty=Tensor[(1, 1008, 16, 16), int8] */;
  %206 = qnn.conv2d(%205, meta[relay.Constant][252] /* ty=Tensor[(1008, 1, 3, 3), int8] */, -128 /* ty=int32 */, meta[relay.Constant][253] /* ty=Tensor[(1008), int32] */, 0.0235294f /* ty=float32 */, meta[relay.Constant][254] /* ty=Tensor[(1008), float32] */, padding=[1, 1, 1, 1], groups=1008, channels=1008, kernel_size=[3, 3], out_dtype="int32") /* ty=Tensor[(1, 1008, 16, 16), int32] */;
  %207 = nn.bias_add(%206, meta[relay.Constant][255] /* ty=Tensor[(1008), int32] */) /* ty=Tensor[(1, 1008, 16, 16), int32] */;
  %208 = qnn.quantize(meta[relay.Constant][256] /* ty=Tensor[(1, 1008, 1, 1), float32] */, meta[relay.Constant][257] /* ty=Tensor[(1008), float32] */, meta[relay.Constant][258] /* ty=Tensor[(1008), int32] */, out_dtype="int32", axis=1) /* ty=Tensor[(1, 1008, 1, 1), int32] */;
  %209 = maximum(%207, %208) /* ty=Tensor[(1, 1008, 16, 16), int32] */;
  %210 = qnn.quantize(meta[relay.Constant][259] /* ty=Tensor[(1, 1008, 1, 1), float32] */, meta[relay.Constant][257] /* ty=Tensor[(1008), float32] */, meta[relay.Constant][258] /* ty=Tensor[(1008), int32] */, out_dtype="int32", axis=1) /* ty=Tensor[(1, 1008, 1, 1), int32] */;
  %211 = minimum(%209, %210) /* ty=Tensor[(1, 1008, 16, 16), int32] */;
  %212 = qnn.requantize(%211, meta[relay.Constant][257] /* ty=Tensor[(1008), float32] */, meta[relay.Constant][258] /* ty=Tensor[(1008), int32] */, 0.0235294f /* ty=float32 */, -128 /* ty=int32 */, axis=1, out_dtype="int8") /* ty=Tensor[(1, 1008, 16, 16), int8] */;
  %213 = qnn.conv2d(%212, meta[relay.Constant][260] /* ty=Tensor[(168, 1008, 1, 1), int8] */, -128 /* ty=int32 */, meta[relay.Constant][261] /* ty=Tensor[(168), int32] */, 0.0235294f /* ty=float32 */, meta[relay.Constant][262] /* ty=Tensor[(168), float32] */, padding=[0, 0, 0, 0], channels=168, kernel_size=[1, 1], out_dtype="int32") /* ty=Tensor[(1, 168, 16, 16), int32] */;
  %214 = nn.bias_add(%213, meta[relay.Constant][263] /* ty=Tensor[(168), int32] */) /* ty=Tensor[(1, 168, 16, 16), int32] */;
  %215 = qnn.requantize(%214, meta[relay.Constant][264] /* ty=Tensor[(168), float32] */, meta[relay.Constant][265] /* ty=Tensor[(168), int32] */, 0.144729f /* ty=float32 */, -4 /* ty=int32 */, axis=1, out_dtype="int8") /* ty=Tensor[(1, 168, 16, 16), int8] */;
  %216 = qnn.add(%198, %215, 0.160035f /* ty=float32 */, 13 /* ty=int32 */, 0.144729f /* ty=float32 */, -4 /* ty=int32 */, 0.246944f /* ty=float32 */, -7 /* ty=int32 */) /* ty=Tensor[(1, 168, 16, 16), int8] */;
  %217 = qnn.conv2d(%216, meta[relay.Constant][266] /* ty=Tensor[(1008, 168, 1, 1), int8] */, -7 /* ty=int32 */, meta[relay.Constant][267] /* ty=Tensor[(1008), int32] */, 0.246944f /* ty=float32 */, meta[relay.Constant][268] /* ty=Tensor[(1008), float32] */, padding=[0, 0, 0, 0], channels=1008, kernel_size=[1, 1], out_dtype="int32") /* ty=Tensor[(1, 1008, 16, 16), int32] */;
  %218 = nn.bias_add(%217, meta[relay.Constant][269] /* ty=Tensor[(1008), int32] */) /* ty=Tensor[(1, 1008, 16, 16), int32] */;
  %219 = qnn.quantize(meta[relay.Constant][270] /* ty=Tensor[(1, 1008, 1, 1), float32] */, meta[relay.Constant][271] /* ty=Tensor[(1008), float32] */, meta[relay.Constant][272] /* ty=Tensor[(1008), int32] */, out_dtype="int32", axis=1) /* ty=Tensor[(1, 1008, 1, 1), int32] */;
  %220 = maximum(%218, %219) /* ty=Tensor[(1, 1008, 16, 16), int32] */;
  %221 = qnn.quantize(meta[relay.Constant][273] /* ty=Tensor[(1, 1008, 1, 1), float32] */, meta[relay.Constant][271] /* ty=Tensor[(1008), float32] */, meta[relay.Constant][272] /* ty=Tensor[(1008), int32] */, out_dtype="int32", axis=1) /* ty=Tensor[(1, 1008, 1, 1), int32] */;
  %222 = minimum(%220, %221) /* ty=Tensor[(1, 1008, 16, 16), int32] */;
  %223 = qnn.requantize(%222, meta[relay.Constant][271] /* ty=Tensor[(1008), float32] */, meta[relay.Constant][272] /* ty=Tensor[(1008), int32] */, 0.0235294f /* ty=float32 */, -128 /* ty=int32 */, axis=1, out_dtype="int8") /* ty=Tensor[(1, 1008, 16, 16), int8] */;
  %224 = qnn.conv2d(%223, meta[relay.Constant][274] /* ty=Tensor[(1008, 1, 3, 3), int8] */, -128 /* ty=int32 */, meta[relay.Constant][275] /* ty=Tensor[(1008), int32] */, 0.0235294f /* ty=float32 */, meta[relay.Constant][276] /* ty=Tensor[(1008), float32] */, padding=[1, 1, 1, 1], groups=1008, channels=1008, kernel_size=[3, 3], out_dtype="int32") /* ty=Tensor[(1, 1008, 16, 16), int32] */;
  %225 = nn.bias_add(%224, meta[relay.Constant][277] /* ty=Tensor[(1008), int32] */) /* ty=Tensor[(1, 1008, 16, 16), int32] */;
  %226 = qnn.quantize(meta[relay.Constant][278] /* ty=Tensor[(1, 1008, 1, 1), float32] */, meta[relay.Constant][279] /* ty=Tensor[(1008), float32] */, meta[relay.Constant][280] /* ty=Tensor[(1008), int32] */, out_dtype="int32", axis=1) /* ty=Tensor[(1, 1008, 1, 1), int32] */;
  %227 = maximum(%225, %226) /* ty=Tensor[(1, 1008, 16, 16), int32] */;
  %228 = qnn.quantize(meta[relay.Constant][281] /* ty=Tensor[(1, 1008, 1, 1), float32] */, meta[relay.Constant][279] /* ty=Tensor[(1008), float32] */, meta[relay.Constant][280] /* ty=Tensor[(1008), int32] */, out_dtype="int32", axis=1) /* ty=Tensor[(1, 1008, 1, 1), int32] */;
  %229 = minimum(%227, %228) /* ty=Tensor[(1, 1008, 16, 16), int32] */;
  %230 = qnn.requantize(%229, meta[relay.Constant][279] /* ty=Tensor[(1008), float32] */, meta[relay.Constant][280] /* ty=Tensor[(1008), int32] */, 0.0235294f /* ty=float32 */, -128 /* ty=int32 */, axis=1, out_dtype="int8") /* ty=Tensor[(1, 1008, 16, 16), int8] */;
  %231 = qnn.conv2d(%230, meta[relay.Constant][282] /* ty=Tensor[(168, 1008, 1, 1), int8] */, -128 /* ty=int32 */, meta[relay.Constant][283] /* ty=Tensor[(168), int32] */, 0.0235294f /* ty=float32 */, meta[relay.Constant][284] /* ty=Tensor[(168), float32] */, padding=[0, 0, 0, 0], channels=168, kernel_size=[1, 1], out_dtype="int32") /* ty=Tensor[(1, 168, 16, 16), int32] */;
  %232 = nn.bias_add(%231, meta[relay.Constant][285] /* ty=Tensor[(168), int32] */) /* ty=Tensor[(1, 168, 16, 16), int32] */;
